[
    {
        "id": 1,
        "title": "Good Intention",
        "content": "Intention is an alchemic prescription that can turn base dirt into noble gold. The hadith says \"All actions depends upon intentions.\" It is sometimes interpreted to mean that good intentions justify bad deeds too and turn sins meritorious. This is entirely wrong. Sin is always a sin no matter how noble the intention may be. For instance if someone breaks into a house to steal with the intention of giving away as alms whatever he would steal would be a thief deserving the prescribed punishment. His good intentions would not earn hire any merit nor would his sin be pardoned. What this hadith means is as follows: 1. A good deed earns merit only if done with right intention. For instance prayer would earn merit only when one prays only for Divine pleasure: if one prays to impress others, then, instead of earning merit, it would earn punishment. 2. The second interpretation which is germane to the present discussion is that all lawful deeds actually earn neither merit nor punishment, but if these are done with good intent, they become acts of worship and earn merit. For instance eating is lawful: but if one eats with the intention that food shall give hire energy and that energy lie shall spend in the service of Allah, the act of eating would earn merit. Similarly if one eats with the intent that his physical beady too has its rights and dues which include nourishment through eating or if one eats with the intent of getting pleasure and taste and of thanking Allah for these, the eating become an act of merit. There is no lawful deed of life, which if done with good intent, does not become act of merit. A few instances shall elucidate the point further: (a) Honest earning, whether by trade or service or industry or agriculture, if done with the intent of rightly fulfilling the duties enjoined by Allah toward oneself and one's family, would become an act of merit. Then if one further intends to spend whatever he may save after fulfilling the needs of himself and his family in helping the poor and in other similar good deeds, he would earn further merit. (b) When a person engaged in learning intends to serve the humanity through his knowledge he would go on earning merit as long as he remains engaged in acquisition of knowledge. For instance a student of religion may decide to propagate the faith, a medical student to alleviate human suffering due to disease, an engineering student to serve his people through his specialized knowledge etc. all these acts would become acts of merit because of the intention which motivates the doer. [Arabic Text Image] A man, knowing that sustenance and subsistence is the responsibility of Allah which He shall fulfil without fail, engages in a particular profession or vocation with a view to serve humanity, his profession would earn him merit. For instance if someone enters the medical profession consciously choosing it from among other professions in order to cure the sick, be would earn merit even if he charges for his services. Such a man would not hesitate to provide free treatment for the poor and the destitute. A cloth merchant who enters this profession to provide clothes to people because clothing oneself is a religious duty, would also earn merit. Similarly a government servant, motivated by a desire to serve the common man and fulfil his needs, would earn merit. \"Thus, every profession, becomes meritorious, provided the intention is right.\" [Arabic Text Image] If one dresses in finery not to show off his status or wealth, but to afford pleasure to others, it is an act of merit. [Arabic Text Image] If one treats his children with love because it is a sunnah of our eternally blessed Prophet, it earns him merit. [Arabic Text Image] If one does the household chores because this too is a sunnah as our eternally blessed Prophet helped in the housework, its merit rewards in the Afterlife. [Arabic Text Image] Loving conversation with wife and children is a sunnah and the eternally blessed Prophet has so ordained, hence such an act is also meritorious if done to follow the sunnah. (g) Hospitality to guests, if shown in pursuance of sunnah is an act of merit. (h) Planting a sapling or plant in the house so that it may one day be of use of some man or animal and please the onlooker would be a good deed. (i) Writing a beautiful and legible hand to make it easy for the reader to read is an act of merit. [Arabic Text Image] If a woman dresses herself in beautiful raiment and wears ornaments and adorns herself to please her husband and if a man remains clean and neat to please his wife, both are good deeds. [Arabic Text Image] If permissible recreation is indulged in to the extent needed to prepare oneself for duties it is a meritorious act. (1) If a watch is kept to know prayer timings and to realize the value of time which is intended to be spent in good deeds, it is an act that earns merit. There are a few common examples from everyday life which can earn much merit for the doer, Imam Ghazali has rightly observed in his 1hya'- al-'ulum that there is no lawful action in human life which, if done with the right intent, cannot be changed into an act of merit. Even if husband and wife give mutual pleasure to each other, each with the intent of giving the other his or her due and making them pure this too would give them merit."
    },
    {
        "id": 2,
        "title": "Du'a (Supplication)",
        "content": "Allah likes his bondsmen to pray to Him. If a man, however munificent he may be, is again and again asked for anything, he sooner or later loses his patience and becomes angry. But Allah, on the contrary, is, pleased the more his bondsmen ask him. Hadith tells as that Allah is displeased with one who does not ask him for anything in prayer. Praying is not only a means of realizing one's purposes but is, in itself, an act or worship. In other words praying even for one's personal ends and worldly needs is counted among acts of worship and earns merit. The more one prays the closer one gets to Allah. It is not necessary to pray only in times of need or of &stress: rather, praying in times of pleasure and plenty is also necessary. A hadith tells us that one who desires his prayers in the times of sorrow and distress to be answered, should pray in times of happiness and plenty. (Tirmidhi cited in h i ' a1 UsulJ Allah has promise in Qur'an 'Pray to Me and I &all fulfill it\". Ths Divine promise can never be wrong so one must pray with Belief and trust in its fulfillment. But Nfillment can take different forms; sometimes one gets what he prays for, but sometimes the desired object is not regarded by Allah as beneficial or useful to his bondsman and so he is granted something better in this life or Hereafter. Thus every act of praying has three advantages: 1. Divine grant of prayers fulfills our desires; 2. Every prayer earns merit; and 3. Repeated acts of praylng bring one ever closer to Allah Although the correct method of praying is to face the Qiblah and raise one's hands and pray with tongue, prefacing the prayer with praise of Allah and darud, but one can also pray without these preliminaries too. Thus Allah has made the act of praying so easy that one can also, pray almost anywhere and at any time; one can pray while engaged in any activity and if one cannot intone the prayer as e.g. in lavatory, one can think his prayer. Also it is not necessary to pray for big or important things; one should pray to Allah asking him to fulfil all one's wants, big or small; hadith tells us to pray even when one breaks his bootless (Tirmidhi). Consequently one should develop the habit of asking Allah to fulfil even the smallest need, to seek Divine amelioration of the most ordinary trouble. Just a child calls his mother for everything big or small, one should call and go on calling Allah. No matter what work one may be engaged in, one should always ask Allah for something or the other. Cultivate this habit and see how quickly you rise."
    },
    {
        "id": 3,
        "title": "Prophetic Du'as",
        "content": "SUNNAH Although one should pray to Allah at all times for all one's needs, our eternally blessed Prophet has taught us some specific prayers for special occasions at different times of night and day, e.g. upon waking up, when going to the toilet and coming out of it, when performing ablution, upon entering and coming out of the mosque, upon entering the house, before meals and after meals hearing the adhan, when dressing, when looking in mirror, before falling asleep in bed. These prayers are all-embracing and extremely useful for all our worldly and other-worldly needs. We, by ourselves, can never think of such prayers which the eternally blessed Prophet has taught us. These prayers are not time consuming nor ablution is their precondition nor is one to raise his hands. If one commits them to memory, one reaps a very rich harvest both here and in the Hereafter. Hence every Muslim must commit these prayers to memory. There are many books wherein they are listed. Maulana Ashraf Ali Thanvi's \"Munajat-e- Maqbul\" has most of them. You should commit them to memory and ask your children to memorize them too. PRAYING FOR OTHERS. One prays for one's own needs and desires, but one should also pray for one's relatives, friends and Muslims in general as it is an act of great merit. There is a hadith which says that when a Muslim prays for anyone of his brothers in faith in the latter's absence angels pray for the same for him. (Sahih Muslim). Hence if you come to know that any Muslim is in trouble or need, pray for him. In fact one should I pray for the unbelievers too so that they may be I Divinely guided on to the path of Islam. Thus one gets merit for We act of praying as well as for wishing well for others."
    },
    {
        "id": 4,
        "title": "Seeking Forgiveness (Istighfar)",
        "content": "SEEKING PARDON I Seeking Divine pardon is an antidote for the I I poisoning of human soul by sinning. Every sin against Allah, however heinous 'if may be, is I forgiven if one seeks Divine pardon for it. Whenever I a sin-great or small-is committed, it should be atoned for by seeking pardon, and even when no I sin has been apparently committed, one should seek I Divine forgiveness. Every Muslim knows that the I eternally blessed Prophet Muhammad was free of all sin, but even then he has said that \"I beg for I Allah's forgiveness seventy times or more every day. I (Bukhari) In one hadith the eternally blessed Prophet is quoted as follows: \"Whosoever regularly seeks Allah's pardon, Allah makes for him a way out of all tight corners, removes all his worries and grants him sustenance from sources he had never imaginedn(Abu Daud, Kitab-al-Satat. Bab-al- Istighfar) . Hence one should cultivate the habit of seeking Divine pardon at all times and at least once a (lay, one should tell a hundred beads of Istighfar on the rosary. [Arabic Text Image] One can ask for-Divine forgiveness in any language however the Arabic version is givin below ~6 %< u 9 yo,,& .#.%St [Arabic Text Image] > L c y 3 @ b d C J d \\ ~ f One particular form of seeking Divine pardon has been particularly lauded in hadith, and it has been designated as Chief of all Prayers for Divine Forgiveness; it is given below: / r / , ,./ /* [Arabic Text Image] GI; $ z u \\ 3 p 3 ! ~ ' [Arabic Text Image] I ' 0 , [Arabic Text Image] fl [Arabic Text Image] [Arabic Text Image] [Arabic Text Image] ,+ [Arabic Text Image] . .> -* 4 ,, , / J , , < 4 , *< , /,,'.\"'# [Arabic Text Image] * > / [Arabic Text Image] - ,,.* [Arabic Text Image] [Arabic Text Image] Translation: 0 Allah! You are my Sustainer there is no god but You, You created me, I am Your bondsman and am to the best of my abilityfirm on my oath to You. I seek refuge with You against whatever I have done. Whatever boons You have showered on me, I invoke them and turn to You and i also turn to You against my sins. Hence forgive my sins because there is none save You who forgives sins. Hadith tells us that whosoever intones these words with full faith in the morning and dies before - nightfall shall be counted among those of the Paradise, and whosoever says them with full faith at night and dies before morning shall likewise go to paradise. (Sahih Bukhari, Bab Afdal-a!-Istighfar) Specially before going to sleep, one should briefly recall one's shortcomings and wrongdoings of the day and seek Divine Pardon for them and Grace."
    },
    {
        "id": 5,
        "title": "Dhikr (Remembrance) of Allah",
        "content": "Dhikr i.e. mental or verbal remembrance of Allah is so consoling, pleasant and easy form of worship that one can perform it continuously at all times and with great benefit, Allah has enjoined His Dhikr in the Quran in the following words: Obviously dhikr does not benefit Allah, Who has no need of in the benefit is for Allah's bondsmen since dhikr strengthens the bond between Allah and His bondsmen, is food for the soul which invigorates it. And with an invigorated soul it becomes easy to overcome one's base instincts and to vanquish the Devil. Thus one is able more easily to avoid sins and the good deeds increase. Someone asked our eternally blessed Prophet 'Which worship is highest, in the Eyes of Allah and which shall be reckoned weightiest on the Day of Judgement?\" The Prophet replied \"Dhikr of Allah\" (Jami'al Usul, p. 475 Vol. 4) A companion once submitted to the eternally blessed Prophet '0 Messenger of Allah! Good deeds are many and I do not have the strength to perform all of them. So please tell vie one thing that I may always remember. Please do not tell me niany things as I would forget them.\" The Holy Prophet said \"Your tongue should he wet with dhikr of Allah\". (Jami Tirmidhi, Dawat Bab Fad1 a1 Dhikr). Abu Musa Ash'ari has been quoted as follows: The eternally blessed Prophet said \"A house wherein Allah is remembered and a house wherein He is not remembered are like living and dead bodies\" (Bukhari and Muslim) Another hadith quotes our Prophet as follows: \"People who leave a meeting or conclave without mentioning and remembering Allah are like those who get off from a dead ass, and such a meeting they would repent (for time misspent] on the Day of Judgement\" (Abu Da'ud) That's why a hadith tells us to recite the following worlds at the end of every meeting or This atones for the sh-ortcomings of the meeting. In spite of the great merits of dhikr. Allah has made it very easy. There are no preconditions attached to it. If someone performs ablution and then sits facing Qibla and performs dhikr it is all for the best. But if there is no time or occasion for it then one can perform dhikr while engaged in other works, even ablution is not required and dhikr is permitted even when unclean after coition or while menstruating. However one should not perform it verbally when unclothed or when in some unclean place like lavatory. However even there dhikr can be done without intoning or moving the tongue. Thus the merits of this worship can be reaped at all times without any difficulty. However it is appropriate to fix a particular time in the night or the day when one can perform dhikr after ablution and facing the qiblah; dhikr at other times would be an added boon. For special dhikr the following books may be consulted. 1. Fada'il-al-Dhikr by Shaikh a1 Hadith Hadrat Maulana Muhammad Dhakariyya. 2. Dhikr Allah by Maulana Mufti Muhammad Shafi. 3. Ma'mulat-e-Yaumiyah by Dr. Abdul Hai Arifi However some brief adhkar are given below which should be recited continuously. 1. Hadith quotes our eternally blessed Prophet as saying that \"The following four phrases are most pleasing to Allah. (Sahih Muslim) 2. Hadith tells us that two phrases most pleasing to Al-Rahman are light on the tongue but view weighty on the Day of Judgement: J' ' #MS.# a / # & ,&l'dl+ [Arabic Text Image] (Bukhari Musliml C C S 4,. ., H 3. Hadith tells us to recite : & ~ y l ~ ~ ~ ~ f l much because these words are amohg the treasures of paradise. (Mishkat) 4. Hadith tells us that if one recites these words in the morning he gets merit equivalent to freeing of ten slaves from among the progeny of Prophet of Islam, he gets ten good deeds recorded in his name, his ten sins are pardoned he is elevated by ten stages and is protected against the Devil till evening. And if he recites these words in the evening; he gets the same reward till morning (Abu Da'ud)."
    },
    {
        "id": 6,
        "title": "Blessings upon the Prophet (Salawat)",
        "content": "DARUD Ahadith mention in detail so many advantages and merits of blessing the holy prophet by reciting Darud that one can compile a whole to me, and many learned people have in fact written books on them. One hadith quotes the Holy Prophet as saying that \"One sent by my Sustainer came to me and told me that 'Whoever from your ummah sends darud on you once ten good deeds are recorded on his behalf, his ten (minor) sins are pardoned and he is elevated by ten stages\" (Sunan Nisai and Musnad Ahmed, Al-targhib li al Mundhari, P.157 voIume3) And Anas, a companion, has said that the eternally blessed Prophet said that \"When my name is mentioned before anyone it is incumbent upon him to send durud on me, and whosoever sends darud once, Allah sends his Mercy on him ten times (ib id .) The best darud is the darud-e- lbrahime which is recited in prayers and the briefest is Sallallaho alaihi-wa-sallam, the latter also has the same merits as others. It should be noted that when the holy Prophets* exalted name is written, one writes sallallaho alaihi-wa-Sallam after it and not salla'am which is insufficient."
    },
    {
        "id": 7,
        "title": "Gratitude (Shukr)",
        "content": "Allah bestows countless boons on me on every instant; they are countless as Allah Himself says in the Qur'an: % ,J.,J=$; bw-9, 1-3 Shaikh Sa'di has said that if one ignores other boons and mercies, life itself is a boon of highest order, in so fir as the act of breathing itself has two boons of inhalation and exhalation; if breath, goes in and does not came out it is death and if breath goes out and does not cone in it is again death. Hence every breath has two boons for which Allah must be thanked. However even if one thanks Allah once with every breath, it is still insufficient; so how can one adequately thank Allah for other boons and mercies? Though it is impossible to thank Allah adequately, but thanking Him to the best of ones ability is a pleasing to Allah and earns countless merits, and also leads to the grant of further boons and mercies, one also get closer to Allah as he has said: 4 /, ,,a: / a d [Arabic Text Image] [Arabic Text Image] * < urss;)t> 3>c1>u+;t &fi$b In another place, He says: Allah likes a thankful bondsman and dislikes a thankless one, since thanklessness is extreme narrow mindedness. A thankless person laments even slightest troubles and ignores the countless mercies and boons; he is more aware of his troubles than of his comforts, A thankful person, on the contrary is thankful,, even in direst troubles, for the innumerable boons he enjoys, while praying, for deliverance from his troubles. Suppose a person is sick. If he is thankless, he would ignore all other blessings, regard himself as the most troubled and aggrieved person in the world and lament his fate. But if he is a thankful man he would think of the healthful period of his life and then he would think of his treatment of and the presence of his well- wishers and friends as mercies, he would think of people more sick than himself and thank Allah for sparing him more serious sickness, He would pray for his recovery but not by way of complaint, he would pray as a besieger and pleader. He would never utter anything smacking of thanklessness. Devil assails man by first making him ungrateful. The Qur'an tells us that when Devil was granted leave till the Day of Judgment he said that he would mislead Allah's bondsmen in every way and he further said: This shows that Devil's greatest desire is to make Allah's bondsmen thankless so that they may be bereft of the worship of thankfulness. But if someone is determined to be thankful, he is spared Devil's guile and wile. Thus thankfulness to Allah is a supreme act of worship which requires only a few moments. ' :/ # & l ~ ~ l ~ * ~ ~ ; s ~ 4 # # ' He who thanks Allah after eating earns the same merit as one who fasts and desists from eating. (Bukhari and Tirmidhi) Consequently, one must thank Allah for all his boons and mercies, whether big or small. One should thank Allah when on returning home, he finds his family safe and well, when he eats f=od when his hot brow is fanned by cool breeze, when he sees his child happily at play; in other words everything which pleases and comforts should be acknowledged with thanks to the One Allah who is the Real and the Ultimate Source and intone his thanks, he should do it in his heart. Saints and learned ones have also instructed that upon going to bed and before falling asleep, one should think of Allah's gifts and boons and thank Him for every one of them. For instance, one should think of the good health of his family and himself; of the house which he lives in, of the comfortable bed he sleeps in, of his own safety and that of his family and thank Allah for these Divine mercies before closing his eyes in sleep. Real and true thankfulness to Allah implies changing ones ways to into those that please the Almighty, but if one merely expresses his thankfulness in his heart or by mouth, it too is an act of great worship. This can lead to a change for the better in other deeds. While there are no specific wards prescribed for showing one's gratitude to Allah and He can be thanked in any language, our exalted and eternally blessed Prophet has taught us some compressive words to express our gratitude to our Maker; these are given below. &j!*;ggq,;,$&pJi&p& a,/' [Arabic Text Image] ' [Arabic Text Image] / [Arabic Text Image] 4 ' Bd 4 3 4 & . % m a w r J & ~ ~ + & - # , # , N J , ~ &p3,&j;~,34~3.='r'.bl+G << -4 'rC3&j&$jr;&* 1.0 Allah!l thank Thee with a thankfulness that is eternal with Thine Own Eternal Being. I thank Thee with a thankfulness that is unlimited but for Thine Will. And I thank Thee with a thankfulness the speaker of which desires naught but Thine Pleasure And I thank Thee with every batting of the eyelids and with every breath. , , ,0.*,/,,J [Arabic Text Image] [Arabic Text Image] & & a 1 b 9 & & t h d ~ & l - @ # *< 4 / / 4 [Arabic Text Image] '*' ~ L J J e [Arabic Text Image] 2. 0 Allah! I praise Thee as many times as the number of Thine creatures, as the blackness of Thine words as the weight of Thine Throne and in accordance with Thine Pleasure. 3. It is reported from Abdullah ibn Ghannam that our exalted and eternally blessed Prophet taught the following words of thankfulness. 0 Allah! Whatever boon I or anyone of Thine creatures get is from Thee only; there is none coeval with Thee hence all praise and all gratitude are for Thee alone. The Holy Prophet may he be blessed eternally said that whosoever spoke these words in the morning would be thanking Allah for that day and if he spoke these words in the evening he would be thanking Him for that night."
    },
    {
        "id": 8,
        "title": "Patience (Sabr)",
        "content": "Allah has created three worlds: one of complete bliss and comfort without any shadow of grief or pain which is Paradise; the second of pain and grief without any shadow of bliss or comfort; which is Ohell; and then there is the third world where bliss and grief and pain and comfort coexist, and this one is our present world. Consequently, there has never been nor can ever be, a man who has not at some time in his life tasted sorrow. Man, however rich or pious or powerful he may be, would experience pleasure as well as pain; even Allah's chosen messengers have suffered in this world. Hence, one who wants to be wholly and permanently free of sorrow and pain does not know the nature of this world and this desire of his can never be fulfilled. Of course, the measures of pleasure and pain may vary, but complete and permanent freedom from pain is impossible. It is thus obvious that every one of us is visited by sorrow and pain in one form or the other. So if his lot impatient and frantic and laments his fate and bewails his lot it would not rid him of pain and sorrow. Such a behavior would, one the one hand,, exacerbate the feeling of pain and sorrow, and, on the other hand, his impatience would be of grave disadvantage to him in so far as the pain and sorrow which could earn him merit and reward would remain barren. In contrast to this, there is a man who in times of pain and sorrow thinks of the brevity of mundane life and the inevitability of pain and then thinks that whatever Allah does has some Divine Design which man cannot unravel. This man then does not lament his lot nor does he complain; rather his faith in Allah and His doings is strengthened since whatever Allah does he believes Him to change his pain and sorrow into pleasure and comfort and to save him from such plights in future. This way of thought is \"patience\". Patience has the advent age that it brings solace and banishes dismay. Moreover the pain and sorrow thus become causes for boundless reward and merit since Allah says : Please note that sorrowing and worrying in times of trouble and trial are not sins, even weeping is sudden shock is not a sin, nor is it an act o impatience. Impatience is to criticize Allah and to lament and complain. Patience is to hold firm to one's faith in Allah even when h s whole world is crumbling into rains and heart is heavy with grief anti ewes are brimming with tears. It is this patience for which has been promised boundless reward. One sign of patience is to repeatedly say: For those who recite these words in times of trial and tribulation. Allah has said: Consequently our saints and learned men have rightly said that patience is equal to a thousand acts of worship and it leads to man's spiritual elevation. It does not require any major catastrophe for one to show patience and recite: in everyday life there are many minor pinnipeds which should be countered with the recitation of this ayah. Umme Salma has quoted our Holy Prophet as saving that \"When someone of you is afflicted by some pain or is troubled. A hadith tells tis that once when a lamp went out our Holy Prophet recited this ayah. This clearly shows that must be recited when assailed by even minor troubles, and similarly patience should be exercised even in everyday problems and worries so that one gets merit of an act of worship. A sudden stumble, a prick of a thorn, failure of electric power, a bad news, a loss, all should be met with a recital of and it should be firmly believed that some Divine Purpose is at work behind every unpleasant event. This is true patience that ways earns immense amount of merit. Another point to be remembered is that just as shedding tears over some grievous event is not contrary to patience, trying to ameliorate one's lot and remove e the cause of pain and sorrow tone is not against the practice of patience. Seeking employment when unemployed obviously does not run counter to the practice of patience. One should try to better one's condition ana also go on praying to Allah. Groaning due to pain is also not contrary to patience. The reality of patience is, as described above, not criticizing or bewailing any Divine decision, and reciting. This recital is simple and brief but it earns immeasurable reward and merit."
    },
    {
        "id": 9,
        "title": "Beginning with Bismillah",
        "content": "WORK WITH \"BISMILLAH\" Recital of \"Bismillah\" when starting any work is a sign of Muslims. Our blessed and exalted Prophet has said - [Arabic Text Image] 4 3 / B ~ , y /, • . ~ 1 d $ l ~ 4 i j , l d + ~ h 6 ? @ ~ 'Every important work not began with Bumillah remains imperfect and half clone\". According to the established sunnah of our eternally blessed Prophet, every important1 work should be started with Bismillah and every Muslim must follow it and inculcate this habit. Bismillah should be recited when entering or leaving the house embarking upon a vehicle and upon and upon disembarking from it, when the steed or mount stumbles, when one himself stumbles, upon entering the 'mosque and coming out of it, a little before entering the lavatory and immediately upon coming out of it, before starting 1 - All good work to eat and drink, upon starting to dress, before putting on shoes, before reading a book, before writing a letter or anything else, before starting day's work, before entering into a pact, in fact every change of state should be prefaced with Bismillah. Women too should recite it when starting to cook, when serving food, when stitching a dress, when dressing a child; they should also inculcate in their children the habit of reciting Bismillah is very easy and leads to rapid accumulation of much merit in one's record. Recital of Bismillah turn mundane activities into acts of worship. A Muslim and an unbeliever both carry out the daily routines of life but there is immense difference between the two: the unbeliever does everything in a state of unawareness, while a Muslim does whatever he has to do by consciously accepting and realizing the fact that nothing can be accomplished without Divine Will Help and Pleasure. This realization change worldly acts into acts of devotion to, and worship of Allah. The advantages of reciting Bismillah have been discussed in detail in \"Bismillah kay Fadail-o-Masa'il\" by the author's father Maulana Mufti Muhammad Shafi: its study shall be of great benefit."
    },
    {
        "id": 10,
        "title": "Initiating Salam",
        "content": "Greeting brother Muslims is one of these Islamic practices which are hallmark of a Muslim and its merits have been anointed in many ahadith. e.g. \"One who takes pretence in greeting others is closer to Allah\". (Abu Daud ) It is not necessary to greet only those with whom one is acquainted; greeting strangers who are known to be Muslims is a matter of great merit Our holy Prophet, may lie be Divine, blessed eternally, was asked as to which action are good for Muslims. Among the actions which our holy Prophet enumerated was this: \"You should greet people whether you know their or not\" (Sahih Bukhari. Sahih Muslim) It is reported about Abdullah bin Omar that sometimes he went out of the house only to greet any Muslims he met and thus to increase his merit. (Muvatta Imam Malik) The correct interpretation of this hadith, however, is that one should greet others, though not everyone one sees because it is impossible and it might also be embarrassing for others. (A1 Adab a1 Shariah, li ibn Muslih page 422, volume 1) It is also a sunnah to greet the family when entering the house. Our holy Prophet instructed his personal servant Anas as follow: \"0 son! When you enter (your) house, greet your family member; this act shall be of benefit for both you and your family members\" (Tirmidhi) Even when entering an empty house one should greet with the intent that angels are being greeted. Abdullah ibn Omar used to say : , ,0/0,/04@, ~ L ~ I & I ~ L E & , ~ X ~ ~ &.. / . I on such occasions (A1 Adalf al Shariah li ibn Muslih, p.424, vol.1) Hadith also urges the muslims to clearly speak out the greeting so that it may be heard and understood. Although the sunnah of greeting to fulfilled by saylng \"A1 Salam Alaikum \". but adding \"wa Rahmat ulla-wa barakatuhu\" earns more merit. Imran bin Husayn recounts that once he and others were in the presence of our exalted and eternally blessed Prophet when a man came and said: -&WV \"As-salamo alaikum\", to which the blessed Prophet responded and said \"Ten\" (i.e. the person who had greeted him, had earned ten merits); GLdb then another man came and he said, \\ i ) .\\ 'Xssalamo alazkum wa Rahmatullah\", to which the blessed Prophet responded and said 'Twenty' (i.e. the man had earned twenty merits); finally a thira man came and said salamo alaikum wa Rahmatullah wa Barakatuhu\"), to which the exalted Prophet responded and said 'Thirty\" (i.e. he had earned thirty merits) (Abu Daud, Tirmidhi, Jami a1 Usul, p. 602. vol. 6j, It should be noted here, however, that salam i.e. greeting is a sunnah only when the person greeted is not busy or when salam would not disturb him; if salam is going to disturb him in whatever he is doing, e.g. reciting Qur'an or doing dhikr or tending the sick or studying or doing something else in which loss of concentration would cause loss, the one should wait till the work is finished. Similarly it is not right to salaam when somebody is making a speech, and speaker too should not do it. However if a group is sitting quietly and somebody passes by then he should greet them; if someone wishes to join them then just one salaam is enough and single response from one of the group fulfills the sunnah . To be the first with salam is sumah and he who does not reply to it is a sinner. When a letter is received in whichif@t'5 I 'salaam alaikum\" is written, it should be responded to in the prescribed manner while reading the letter."
    },
    {
        "id": 11,
        "title": "Visiting the Sick",
        "content": "Visiting the sick is an act of great merit and is included in the human rights an enunciated by the exalted Prophet, may he be blessed always. Some jurists regard it vajib, but in fact it is a sunnah. Thauban relates that our Holy and eternally blessed Prophet has said that \"when a Muslim visits his sick brother in faith, he is all the time in the garden of Paradise. (Kitab al Birr wa a1 Silah and Tirmidhi. Kitabal-Khabaiz) Ali has said that he heard our Holy Prophet saying that \"When a Muslim goes to visit another ailing Muslim in the morning, seventy thousand angels pray for his forgiveness till evening, and if he goes visiting till the evening, seventy thousand angels pray for his forgiveness till morning and he is granted a garden in the Paradise\". (Tirmidhi. Kitab a1 KhabaiZ. Hadith 969). Our exalted and eternally blessed Prophet, hearing of sickness of anyone among his acquaintances, went to visit him. The correct way of visiting the sick is to put one's hand on the sick man's forehead and inquire after his illness, but only if putting the hand on his forehead does not cause the sick one pain otherwise it is sufficient to ask how he was. Out exalted Prophet has taught us the following prays which is to be recited seven time when visiting the sick:- [Arabic Text Image] -, . [Arabic Text Image] , *-, This prayer heals the sick, provided his time of death has not come. Our holy Prophet also used to recite the following prayers several times while visiting the sick:- : ,., ' , ?, [Arabic Text Image] 0 [Arabic Text Image] I /,, [Arabic Text Image] ~&.dJ3&y 36.j3;6L3J and also said r: . [Arabic Text Image] 0 ' . / 3 1 ; ~ ~ ~ ),&cry9 , It should be remembered that the visitors actions should never cause the slightest trouble or pain to sick and this has been emphasized more than visiting the sick. A visit which pains or trouble the sick would be a sin rather than act of merit. Thus if visitors are not allowed to see the patient, they must not visit; in such a case mere asking and praying for the patient become an act of merit. There is no need to have one's visit reported to the sick man. But if it is intended to please the patient then the names of the visitors may be told to him at sonic appropriate time Hadith has also emphasized that visitor must not stay very long with the sick man because it might harm the patient. However, if the patient wants someone intimate to stay with him then there is no harm in staying long. It is also necessary to choose the right time for the visit; it is not right to visit a patient when he is resting or is otherwise engaged. Hence it is better to find out beforehand the appropriate time for a visit."
    },
    {
        "id": 12,
        "title": "Attending Funeral (Janazah)",
        "content": "SERVICE (NAMAZ-E-JANAZAH) AND BURIAL Participation in the burial service of a Muslim and accompaniment of the funeral procession up to the graveyard have been designated as acts of great merit in ahadit.: in tact our most exalted Prophet has called it a right of the dead that the living ones pray for them and accompany them to graveyard. Although participation in burial service and burial are ford kifayah, i.e. if a few do these, it does not remain compulsory for others, yet both are acts of great merit. Abu Hurairah has reported that our holiest Prophet said that \"Whosoever participates in burial service {namaz-e-janaza carps one carat and if he remains till burial is complete, then he gets two carats, each carat being equal to the Mount of Ohud\". They should participate in this prayer not as a matter of pure form but for the sake of Allah's pleasure; this would certainly fetch much merit. Accompanying the funeral procession after the prayers is, as said above, an act of great goodness which, according to Mujahid, is of a higher order than nafl prayers. (Fath- a!-Bari. p.193. vol 3. ref. Abd-al-Razzaq)."
    },
    {
        "id": 13,
        "title": "Consoling the Bereaved",
        "content": "CONSOLING It is an act of great merit to offer condolences on somebody's death and to console the bereaved family by word and deed. Abd Allah ibn Mas'ud has quoted our beloved Prophet (may Allah eternally bless him) as saying: ~ ~ & t & ~ ~ ~ ~ ~ , One who condoles with or consoles a troubled man get as much merit as the troubled man gets for his grief. (Jami' Tirmidhi, Kitab-al-Jana'iz. Hadith 1073) It may be noted that condolence is generally taken to mean expression of grief and so, instead of consoling and comforting the bereaved family, causes them more grief. Condolence actually means consoling and sympathizing, hence it encompasses all ways and means of comforting the mourners and giving them solace and reducing their anguish. The act of comforting does not deserve and earn merit only when someone dies: the Hadirh quoted above shows that comforting and commiserating with anyone who is in pain, trouble or sorrow ears the same merit as the sufferer is getting for his suffering. (i) These words occur in the tradition quoted in Jam i' Tirmidhi. (Tirm idhi: Kitab-a1 -/aria 'iz. Hadith 1040, chapter 49) but actual hadith has also been quoted in"
    },
    {
        "id": 14,
        "title": "Love for the Sake of Allah",
        "content": "SAKE OF ALLAH To have love for someone for the sake of Allah's pleasure is also a grand act for which much merit and many rewards have been promised. 'To love for the sake of Allah\" means loving someone, not for any worldly gain, but because he is more religious and I pious or he is very learned in din or is busy in serving the cause of din or because loving him or her is commanded by Allah, e.g. one's parents. li Such a love has been called \"love for Allah\" in &adith. F i One hadith says: i Allah shall ask on the Day of Judgment, \"Where i are those who loved for the sake of My Greatness? Today when there is no shade save Mine, 1 shall have i them in My Shade\" [Sahih Muslim: Kitab a1 Birr wa a1 t Silah) I Another tells us that 'On the Day of Judgment. Those who had mutual love for the sake of Allah's Greatness shall be on pulpits of light and all shall envy them (Jami' Tumidhi, Kitab al Zuhd) Abu Idris Khulani, one of the famous fabi'in says that once he visited Muadh ibn Jabal in the mosque of Damascus and told him that \"By Allah I love you for the sake of Allah\". He repeatedly asked me to swear if it was so and when 1 answered in affirmative every time he pulled me by my shawl and said 'Hear the good news! 1 have heard the exalted and blessed Messenger of Allah saying that 'My love shall certainly be for those who love each other for my sake, who sit in each other's company for my sake, who go to meet each other for my sake and spend money on each other for my sake.\" (Muvatta Imam Malik, Kitab-al- Shirr). Having love for Allah's pious and good bondsmen is actually an outcome of one's love for Allah, so it earns the same rewards and merits as the latter, because of this love. Allah includes His lover in His beloved people. According to a hadith, someone asked our blessed and exalted Prophet\". When shall come the Day of Judgment?\" Our Prophet asked hits \"What preparation have you made for the D a y The man said \"Nothing, but I have love for Allah and for his Messenger\". The Prophet said \"You shall be (on that Day) with whom you love.\" The above hadith has been quoted by Anas. He says that these words of the Holy Prophet mere so pleased us as nothing else had ever done. He further said \" 1 have great love for the Holy Prophet - may he be eternally blessed - and with Abu Bakr and Umar, may Allah be pleased with them, and because of this love I hope I shall be in their company, even though my deeds arc not equal to theirs.\" (Sahih Bukhari, kitabal-Adab, chapter' Alamah a1 Hubb fi Allah). There are many ahadith of the same import showing that having love for someone for the sake of Allah is an act of great merit, which grants one the opportunity of doing good in this world and being in exalted company in the Hereafter. Hence one should love good people for the sake of Allah and with the intent of becoming good oneself and earning Allah's pleasure, as the poet says: 0 I # t,fi$;s& [Arabic Text Image] '7 love good people (and) although I am not one of them, may Allah grant me goodness too. Hadith tells us that when one someone loves his brother in faith, he must tell him of his love (Abu Daud: Kitab-al-Adab; Tirmidhi: kitab-al-Zuhd). Anas has recounted that someone was sitting with our Holy Prophet when another one passed. The sitting one said ' 0 Messenger of Allah! 1 love this man\". The Prophet said \"Have you told him?\" The man said 'No\". The Prophet said 'Tell him!\" The man rose to his feet and went to the man who was passing and said \"I love you for the sake of Allah. He said \"May Allah Whom you love, love you in return!\""
    },
    {
        "id": 15,
        "title": "Helping a Muslim",
        "content": "To help a Muslim in some important work and to do it for his sake or to remove his troubles and womes is an act which has been promised much reward by the Prophet: Abdullah bin Omar said that our Holy Prophet said: 8 (/ J\"i. / - , *b , /,. , , [Arabic Text Image] t,,J / at/,: 0,<t,, , , # , [Arabic Text Image] .rnbi4$+ - * * , *idk,UU I T34,;fLef3 . .C# \"One who helps someone in his need, Allah helps him in his work, and one who removes any worry or trouble of any Muslim. Allah, in return, removes anyone of his worries on the Day of Judgment\". [Abu Daud, Kitab-a!-Adab, Bad-al-Mu vakhao Telling someone the way, sharing someone's load or helping him with it, and all other acts of public service are included in the acts defined by this hadith. \"Those who help others are truly much blessed,\" as the hadith says:- \"Best people are those who are useful to others\". Hence all occasions of service, big or small, must be sought for; this increases one's merits. If someone is a victim of tyranny, it is the duty of every Muslim to save him from it. A hadith tells us that the Holy Prophet said \"A I Muslim is the brother of another Muslim\", and a brother does not leave his brother helpless nar does he lie to him nor yet makes false promises, nor treats him with cruelty\" (Tirmidhi: A1 Birr wa-al- Silah) Another hadith runs as follows: \"If a Muslim is being insulted and degraded and his honor somewhere and mother Muslim leaves him helpless, Allah would leave the latter helpless on occasions when he would need help. And if any Muslim helps him in when he is insulted and degraded, Allah shall help him when he would need help\" (Abu Da'ud: Adab) Helping a Muslim includes appropriate refutal of any wrong charges or insinuations levelled against another Muslim. Abu Darda' report that our Holy Prophet has said: , I ' 5 , ) ; 3 8 '.: , I [Arabic Text Image] ... ~ > & J U ~ & I ~ J ~ I $ ~ ~ + + J ~ \"One who defends the honer of his brother, Allah keeps the fire of hell away from his face on the Day of Judgment [Tirmidhi: a1 Birr wa a1 Silah, Chapter 20)"
    },
    {
        "id": 16,
        "title": "Interceding for Good",
        "content": "JUSTIFIED RECOMMENDATION To give justified recommendation for someone is an act of great merit. The Holy Qur'an says: and the Holy Prophet has said:- Make recommendation; you shall earn merit. (Abu Daud and Nisari) Once a man asked the Holy Prophet for something; the Messenger of Allah turner! to others and said \"Recommend hm, so that may you earn merit (Bukhari Kitab a1 Adab). A good recommendation, whether affective or ineffective, is in itself a good deed. If it is effective then it might carp double merit. But it should be noted that the recommendation should be for some correct purpose and not for any unlawful purpose because recommendation for some thing unlawful is a grave sin with graver consequences. Hence it is necessary to be absolutely sure that the person recommended is truly deserving of it, and whatever he is being recommended for is justified and lawful. Another point to be noted is that the recommendation should not unduly burden the person to whom the recommendation is being made, first of all it must be assessed if the person is really able to do what is recommended; if not, then recommendation should not be made as it might embarrass hire. If one cannot know whether the person to which recommendation is made is able to act on it or not, then recommendation should not be pressing and one should ask for the work to be done if it can be done. Sometimes even when a person is able to do something, he still has to follow some rules or preferences of his own. In such a case too one should not make specific recommendation but leave it to the person to do it according to his rules and preferences so that he may not be unduly burdened. Nowadays recommendation is made for the sake of its merit in the hereafter but its riles as formulated by shari'ah are not observed. Especially, people do not consider the trouble they may cause to the person to whom recommendation is being made. Remember that there are rules for everything in shariah which have to be followed; it is not at all permissible to unduly trouble anyone even for the sake of another Muslim."
    },
    {
        "id": 17,
        "title": "Concealing Faults",
        "content": "SHORTCOMINGS. If one conies to know of somebody's shortcomings it is a matter of great merit if he conceals it front others provided this shortcoming is not handful or dangerous for others. According to Abu Huraira, our Holy Prophet has said that: \"Allah shall conceal on the Day of Judgement the shortcorn ings of the one who conceals the shortcomings of other \" (Sahih Muslim: Kitab a1 Birr wa Silah ) And Aqabah ibn Amir relates that our eternally blessed Prophet has said that: \"The action of one who conceals the shortcoming of another is as if he saved a girl from being buried alive (Mustadrik:Hakim. p.334, volume 4)"
    },
    {
        "id": 18,
        "title": "Guiding towards Good",
        "content": "To urge others to goodness is also an act of great merit. If someone agrees to do good due to another mains efforts, both shall earn equal merits and reward. Abu Mas'ud Ansari relates that our eternally blessed Prophet has said 'One who guides another to goodness shall earn as much merit as the doer of the good deed' (Sahih Muslim}. If the guidance towards good is in the form of a collective effort, i.e. many persons are guided and consequently do good, the reward of the good deeds of all goes to the guide also (in addition to the rewards clue to actual doers). Abu Hurairah recounts that our Holy Prophet said:, One who calls others to the right path of good I deeds gets as much merits as those who act upon his guidance, and the merits of the doers arc not reduced thereby. And one who calls others to do wrong sins as much as the collective sins of those who follow him in sinning and their sins shall not be reduced at I all\" ~ (SahLh Muslim). While merit is vouchsafed when others respond I to guidance, the very act of guidance to good, whether responded to or not, is one of great merit because hadith tells us that: Giving order to do good is a form of Sadaqah and slopping (someone) from going evil is also a form of Sadaqah (Sahih Muslim). Hence no opportunity of giving good advice to and guiding others should be lost, but care should be taken to adopt a method for this which is not insulting or irksome to the other man. One should not criticize others in Public nor should one adopt an overbearing anti proud stance, advice should be given in privacy and in a soft tune showing one's sympathy anti cornifications hence one should chose a time for advice when the hearer is not worried. Wisdom should be exercised in this anti intent should be of doing good, since the Qur'an says:"
    },
    {
        "id": 19,
        "title": "Charity (Sadaqah)",
        "content": "Sadaqah and charity are both acts of great merit anti effective means of earning Divine pardon and escaping the fires of hell. Qur'an and hadith too are replete with the merits of spending money as sadaqah and in charity: in fact one can do justice to this topic in a book only. Shaikh a1 hadith Maulana Mohammed Zakaria Kandhalvi has written a book \"Kitab a1 Sadaqat\" which is indeed an excellent encyclopedic work on this topic. Hence there is no need to describe in detail the merits of sadaqah and charity: those who desire can consult this book. What we wish to bring to the reader's attention here is that it is not at all necessary to spend overmuch to gain merit; one has to spend only as much as he can afford. If one has only a Rupee and lie spends one paisa on some good work it is as if a man with a hundred thousand rupees spends a thousand. Allah does not care for human wealth; Allah values the purity of intent. Maximum sadaqah with pure intent is as much pleasing to Allah as great spending, and cams much merit anti reward. Our exalted and blessed Prophet has said: -29:::. , /,,: 0-< [Arabic Text Image] d3 JUI 19) \"Escape the fire of hell he it by the length of half a date\" (Sahih Bukhari - Sahih Muslim) This hadith means that if one has nothing save half a slate, and he gives to another who needs it, it too would a sadaqah and would earn merit and lead to Divine pardon. This hadith also clearly shows that the poor should not think that they cannot earn merit through sadaqah: by spending whatever they can afford, they tots can cam this merit. There are some who, after paying zakat, believe that they have done all that is required from them and do not spent a paisa more; this is not justified. Zakat is a duty and the money is to be spent for very specific purposes only. There are many other good deeds which lie outside the imbed of Zakat e.g. contributing to mosque fund. Hence some money over and above Zakat should be spent on outer good deeds too. Our spiritual elders anti saints always set aside a certain portion of their incomes for charitable purposes. Maulana Thanvi always reserved one-fifth of his income for this, others reserved one-tenth or one-twentieth part. The advantage of this practice is that whenever the occasion arises, the money is already set aside and available; this availability is also a reminder. If everyone regularly sets aside some part of his income, he can easily earn much merit and reward: Sadaqah and Khairat (charity) should have only one purpose, viz. obtaining the pleasure of Allah. Those who give away money for these purpose arc amply rewarded by Allah in this world too. Hadith tells us than \"Sadaqah does not reduce wealth:"
    },
    {
        "id": 20,
        "title": "Forgiving Others",
        "content": "Although an aggrieved person has every right to avenge himself within the bounds of shari'ah, but forgiveness is an act of supreme merit. The holy Qur'an says: * J 4 , ; /. ,.: J /,: [Arabic Text Image] ,/,*, ,<*,', && ul*c)lc)3yy~ IJ+d,I+, There is none in this world who is entirely innocent and has never done wrong or committed a mistake, and everyone craves Allah's pardon. Therefore, when someone makes a mistake the aggrieved person should think ofhimself as a seeker of Divine pardon and forgive the wrong doer. The above ayah indicates that a forgiving person can expect Divine forgiveness for his own faults and misdeeds. There are many other ahadith of the same purport: e.g. Abu Darda' relates that our exalted and blessed Prophet has said that:- ''If a person is given physical pain and he forgives it, Allah the Highest elevates his rank and pardons his sins\" One reads in Jami' Tirmidhi that someone had broken a person's tooth, and the assaulted person came to Amir Mu'awiyah's court to obtain redress. There Abu Darda related to him the above Hadith and he gave up the idea of revenge and forgave his assaulter (Jmi' Tirmidhi: kitab a1 Diyat: Hadith 1412) The point to ponder is that if the aggrieved person does not forgive and gets his due revenge, what shall this revenge achieve:' If the injury inflicted is such that it cannot be avenged then not forgiving it would cause the one who inflicted the injury to suffer in the Hereafter. Here one should stop and think how another one's suffering in the Hereafter would benefit the one aggrieved or in injured in this world. Forgiveness here, on the contrary, brings abeut Divine forgiveness for the forgiver, and escape from hell, and Allah the Highest shall pardon his sins. Reason, therefore, tells us to exercise forgiveness. Forgiveness, it should be borne in mind, means here that no revenge is to be sought in this world or in the Hereafter. Such a forgiveness earn much merit. However it is not necessary that the act of forgiving is followed by rapprochement. The latter is involuntary not forced and depends largely upon the future behaviors of the other person. Thus if one forgives anti yet has mental reserves towards the aggressor or transgressor and is unable to maintain cordial rcaltions with him save in the matter of rights (salaam etc.) he too shall earn merit for his forgiveness. Forgiveness also does not imply letting down one's guard against any future aggression. If such an aggression is feared then any step that is taken to safeguard oneself against it is not contrary to forgiveness. In such a case if the previous wrong is pardoned and help, even official help is sought against future wrong doing. This too would not detract from the merit earned for earlier forgiveness. When the urge to avenge oneself upon the wrongdoer awakens, one must pause long enough to reflect that our Holy and Revered Prophet never avenged himself upon anyone. Even when the unbelievers stoned him and blood flowed from his face. He said: ''Oh Allah' Forgive my people. as they do not know\" (Sahih Bukhari Sahih Muslim)"
    },
    {
        "id": 21,
        "title": "Being Soft-Spoken",
        "content": "Tenderness towards others is very pleasing to Allah and is very meritorious. Ayesha (may Allah be pleased with her always) relates that our holy Prophet has said:- 'Xllah is kind and likes kindness and gives that reward for tenderizes whrch is not ,granted for harmless nor for anything else\". (Sahih Muslim) In another hadith related by Ayesha (may Allah be pleased with her). our Prophet (may he be eternallv s 6 ' << [Arabic Text Image] , [Arabic Text Image] < 4 - ' J blessed) says that: et,y, ~ I , ~ ! & ~ ~ & Y & ~ I ~ J b y L s ! 4 & \"Tenderness adorns everything and would make if ugly\" (Sahih Muslim) Tenderness means that one must avoid using harsh words or harsh attitude in anger, and behave and speak with tenderness. If someone has to be checked or if a difference in opinion is to expressed, one should not be rough or harsh, but speak softly and kindly. If a younger person has to be trained and strictness cannot be avoided, it too should be adopted in moderation or to the extent needed. Kind behavior also implies that one must not argue or quairel with others on every issue and think well of them as far as possible. Even haggling over price should not be harsh or acrimonious. One should be ready to accept another's viewpoint if it is acceptable, and when if it is not so one should withdraw from argument. It is not good to compel others to agree with one's own viewpoint and to force them into submission. Jabir has related that our exalted that our blessed Prophet said that ',i: / / , <: ,/ / < # > / J ' [Arabic Text Image] [Arabic Text Image] [Arabic Text Image] 'Xllah is kind to him who is tender and forgiving in selling as well as buying and even when asking others for his due\". (Sahih Bukhari). Hudhaifah ibn Yaman has related that our blessed Prophet said that. \"A bondsman of Allah who was given much wealth would be brought before Allah and would be asked 'what did you do in the world\"' He would submit that 'Oh my Nourisher. Thou hadst given me Thine wealth and 1 traded with it and 1 was forgiving, so 1 made it things easy for the rich and allowed time to the poor'. Allah would say 'I have more right to behave in this manner' and would then turn to His Angels and command them 'Release my this bondsman'. (Sahih Muslim) Abu Hurairah has quoted our blessed Prophet as saying that:- \"One who gives time to thepoor debtor or gives him some relief,. Allah would keep him in the shade of His throne in the Day of Judgement when there would be no shade Save that of His Throne \". (Jam i Tirm idh i ) Abu Qatadah has quoted our revered and respected Prophet as saying that:- [Arabic Text Image] */ ', #: , / . ' , $ , 0 , , / *.~'s.,!.~ifc;r=ru~+.cl I&;.@ / J ? I/,#: ~ * 9 ~ y & ' & F \"One who desires to be relieved of the pains and worries of the way of Judgement, should ease the troubles of the destitute or ease his loan. (Sahih Muslim)"
    },
    {
        "id": 22,
        "title": "Reconciliation",
        "content": "PEACE MAKING Peacemaking between two Muslims who differ among themselves is an act of immense merit. The Holy Qur'an says: and also: These verses clearly show how sublime it is to make peace between two Muslims and to try to restore good relations between than. For this purpose one should tell both of them things about cacti other which may reawaken love and affection between them and remove their misunderstandings. In this connection one can relate even those things which may apparently scent contrary to facts. For example to tell one of the two quarreling parties that the other prayed for every other Muslim which included his adversary. Our holy Prophet inlay he be eternally blessed) has said the following for such an act: \"He is not a liar who makes peace between two persons and conveys good thing from one to another or says anything good\" (Sahih, Bukhari, Muslim) Another hadith gives the following Prophetic quotation: \"To do justice between two persons (meritorious) like (giving) Sadaqah To create bad blood and enmity among people is a diabolical act anti a hadith tells us that nothing is snore pleasing to the Devil than creating discord among then. Hadith tells us that Devil regards sowing: discord between husband and wife as his greatest achievement. In contrast to thus, trying to snake peace anti bring about rapprochement between husband and wife is an act of great merit. This should be especially remembered by those who live together, the family quarells among in-laws which are so common in our society are usually due to ignorance of the basic rules of Islam. If one follows the Islamic rules anti precepts in letter and spirit his Here and Hereafter shall both be pleasant for him."
    },
    {
        "id": 23,
        "title": "Supporting Orphans & Widows",
        "content": "AND THE WIDOWS Helping orphans and widows is also a very meritorious act, as the Qur'an tells us: Sahl ibn Safd. a companion has related that\" ,I). [Arabic Text Image] ' # '\", 1 ' :, ' \" 4 ' [Arabic Text Image] & .&, A&, &,g, L, [Arabic Text Image] , ; / . ,\" \"The Holy Prophet said '1 and guardian of orphan shall be like this in the Paradise' making a gesture with the first two fingers with a very small distance between them. Guardianship of an orphan has been so much elevated by this hadith that if is difficult to conceive its merits. Who can imagine the merits of closeness to the HoIy Prophet which he indicated by his two fingers. \" According to Abu Hurairah, our exalted anti eternally blessed Prophet also explained that whether an orphan's guardian is related to him, e.g. mother, grandfather, brother etc. or not, he shall entitled to merit in both cases (Riyad a1 Salihin. p. 118 quoted from Muslim) As regards widows,. Abu Hurairah has related The Holy Prophet said that \"One, who exerts in the cause of a widow or a destitute person, is llke a crusader in the cause of a widow Allah.' (it is reported by chromidroses) I also think that the Holy Prophet also said that 'He is like one who continuously stands in prayer without break and is like one who fasts without break\". (Sahih Bukhari and Muslim). Abu Huraira has also related the following hadith of our beloved Prophet: \"The best Muslim homestead is the one where an orphan is treated well and the worst one is that where an orphan is ill-treated \". (A1 Targhib li al Mundhiri. p.127, vol 4, quoted from Ibn Majah) Qur'an and Ahadith are both replete with injunctions to help, aid and assist the orphans and widows. The few ayahs and Prophetic sayings quoted above show how much thus action is appreciated by Allah. Hence, whenever there is a chance to help an orphan or a widow, it should never be lost and whatever good one can do to either should be done; this shall - Allah willing - earn the doer much merit, provided the good deed is done with sincerity and not to impress others or hold them in thrill, and the real intent is to carp the Divine Pleasure only. Even if one is thanked or paid for the good deed, one should not regard it as a payment for services rendered, but should look to Allah for reward."
    },
    {
        "id": 24,
        "title": "Spending on Family",
        "content": "SPENDING ON FAMILY Barring a few insensitive and selfish persons, there is none in this world who does not spend money on his family; the only purpose of the struggle for earning a living is to provide one's family with their needs and to make their life easy and comfortable. Few know, however, that this effort too is an act of great merit in the eyes of Allah. According to Abu Hurairah, our Holy Prophet said that \"There is one dinar which you spend in the way of Allah (for jihad), another is that you spend on freeing a slave, another is that which you give a poor man by way of charity, and there is another dinar which you spend on your family (wife and children), the dinar that you spend on your wife and children has the highest merit\" (Sahih Muslim). The reason why spending on one's own family is superior to other spending's is that providing for one's family is a duty (fard), while other arc by way of nafl in nature; obviously fard earns more merit than nag. It also makes the point that spending on one's family has more merit when the family is needy, but when their needs are fulfilled in the proper way, then it is more meritorious to spend on others. Umme Salmah once asked our eternally blessed Prophet ' 0 Messenger of Allah! Do 1 earn mexit even when I spend on my sons from my previous husband Abu Salmah'! They are after all my sons and I cannot abandon them\". The Holy Prophet replied \"Yes you shall get merit for it\". Sa'ad ibn Waqqas relates, that our eternally blessed Prophet said that: \"Whatever you spend for the sake of earning Pleasure of Allah - even for the food you put in your wife's mouth - earns merit\" (Bukhari, Muslim) All these ahadith clearly prove that if one spends money to fulfil the lawful needs of his family with the intent of giving them their Divinely ordained rights as commanded by Allah and of pleasing Allah, then every expenditure urns him the same merit as sadaqah. Behold how infinitely kind and-gracious is Allah that what one does solely to satisfy his own inner urges has been changed by a slight change of intent into an act of such merit that it has become superior to all other sadaqah and expenditures. Hence to please Allah, one should openly spend to fulfill the lawful needs of one's family and should never regret it."
    },
    {
        "id": 25,
        "title": "Good Conduct with Parents",
        "content": "PARENTS Good treatment of parents has been very much emphasized in the Qur'an as well as ahadith. Parents have priority in matter of human rights and also they have more rights them others. For instance read the following verses of the Qur'an: S / / # / + / [Arabic Text Image] ,,,,, [Arabic Text Image] / / [Arabic Text Image] And serve Allah. Ascribe nothing as partner unto him. Show kindness unto parents. Abdullah ibn Mas'ud relates \"Once I asked holy Messenger of Allah - may he be eternally blessed - what action pleased Allah most. He replied 'To pray at the right time\". 1 asked \"What is the next action\"\" He said \"Good treatment of one's parents.\" I asked \"What is the next actionur' He said \"Jihad in the way of Allah\". (Bukhari and Muslim) Abdullah ibn Omar relates: \"Once a person came to the Messenger of Allah and expressed his desire to participate in jihad in order to please Allah. The Holy Prophet asked him \"Are your parents alive:'\" The man said \"Yes. Both are alive\". The Holy Prophet said 'Then go and serve them well\". Another Bersion say that the Holy Prophet said 'Serve them and then perform Jihad\". (Bukhari and Muslim) The ahadith tell us that if one's parents need services then he must go on serving them Jihad does not become absolutely necessary (fard-e-'ain), as serving the parents is superior to Jihad. It is also widely known that Owais Qarni lived in Yaman and desired to visit the Holy Prophet. But since his mother needed his services, our Holy Prophet ordered him not to conic but to take care of his mother. Thus Owais Qarni could not visit and see the Holy Prophet; however, as a reward for his serving his mother, he was granted such a status by Allah that many important companions asked him to pray for them. When he finally came to Madinah during the Caliphate of Omar, the latter rushed to him to ask for his blessings. Serving the parents is normally easy since love for parents is but natural and one is automatically motivated to serve and help them and take care of them. Then parents love their children and do not wish to unduly trouble them, or to make them do thing that are difficult. A little service is enough to please them and earn their blessings. According to one hadith looking at parents with love has merits equal to Umrah and Haj. Thus by serving one's parents, a man can earn much merit. Our Holy and eternally blessed Prophet has said \"May that person be disgraced, may that person be disgraced who, finds either or both of hisparents in old age, and yet is not able to enter the Paradise\" (Mus2 im) It means that it is easy to earn Paradise by serving, helping and taking care of old parents, and whosoever doe not do it deserves disgrace. Mother has been given more right to children's love and service than the father. Abu Hurairah relates: \"A person came to our Holy Prophet and asked '0 Messenger of Allah! Which one among the people is most deserving of my good treatment?' The Holy Prophet replied 'Your mother!'. Then man asked, 'Then?'. The Holy Prophet again said ' Your mother'. Upon being asked the fourth time, the Holy Prophet replied, 'Your father\"'. (Bukhari and Muslim) It is on the basis of this hadith that the theologians have opined that mother has thrice the right of the father on her children. This is obviously because mother has greater responsibilities then father in bringing up and rearing children; her troubles have been especially mentioned in the Qur'an. Moreover, she needs more help in her old age than the father . This is why mother is placed higher than father by Allah. Taking care of parents is in any case one of the fundamental duties of man but taking care of them in their old age has been particularly emphasized in the Our'an. The emphasis is because in their old age, the parents are no longer able to be of any physical or monetary use for their offspring and so, often selfish children abandon them. Moreover, in advanced age, one is sometimes short tempered and their words and whims create resentment. So the Qur'an has asked us to remember how our parents cared for us when we were helpless in our infancy and how they pampered us and hence it is now our turn to pamper them, to bear with them with patience and serve them and take care of them. It is after seen that parents are ignored when they are alive and when they die, they are remembered anti it is regretted that they were ignored and no care was taken of them. But then it is too late. So every opportunity of earning for them should be taken. However, even after their death one can still go on serving the parents. Abu Usaid has related that \"One day we were with the eternally blessed Messenger of Allah when a person from (the tribe of) Bana Salmah came and asked him, '0 Messenger of Allah! Is there any way 1 can treat my parents well after death\"' the Holy Prophet replied: 'Yes. Pray for them, pray for their forgiveness, fulfil their promises after them, be courteous and kind to their relatives and respect their friends\". The methods preached by our beloved and ever- exalted Holy Prophet can always be followed."
    },
    {
        "id": 26,
        "title": "Respecting Parents' Friends",
        "content": "TO PARENTS RELATIVE AND FRIENDS As the hadith quoted in the last section shows, dutiful and good behavior not only towards parents, but also towards their relatives and friends is an act of great merit. Abdullah ibn Omar relates that our exalted and eternally blessed Prophet has said that: ,&I:; - > 3 3 , J&;sSl$ii, , , \"One good deed among others is to maintain cordial relations with the relatives of one's father\" (Sahih Muslim) Abdullah ibn Dinar, a pupil of Abdullah ibn Omar says that once the latter was riding a camel to Makkah and there was a she-ass on the leash with him. He rode each alternately. On the way he met a peasant and asked him his and his father's name. When the peasant told him, he gave his she-ass to the peasant and also his turban. Those who were travelling with him asked ibn Omar why he had given so valuable a present to a peasant who could be pleased with an ordinary gift. Abdullah ibn Omar explained that the peasants' father was a friend of his father's and that he (ibn Omar) had heard our eternally blessed Prophet say that 'One good deed amongst others is to maintain cordial relations with the relatives of one's father\" (Muslim) Thus one very good way of increasing good deeds in one's record is to maintain cordial relations with the relatives and friends of one's parents and to treat them with respect, courtesy and consideration."
    },
    {
        "id": 27,
        "title": "Good Marital Relations",
        "content": "RELATIONSHIP. Mutual respect, love, understanding, courtesy and a mutual consideration of each other's needs plus mutual tolerance are not only a must for marital and familial bliss but also very meritorious. The exalted and eternally blessed Messenger of Allah has said that: J J J / , e ' ) ~ ~ t , # / e , , , p *,,P,,, [Arabic Text Image] ., ../. 'The most perfect faith have those Muslims who have better morals, and the best of these arc those who arc best for their women\" (Tirm idh i) A hadith has already been quoted which says that the food which one puts in his wife's mouth earns him merit. Another hadith goes a bit further and predicts merit even oh the sexual act of husband and wife. Some of the companions once asked the Holy Messenger of Allah, We satisfy our carnal needs; does it too carp merit'.'\" Our Holy Prophet replied, 'Tell me would it not be a sin if someone did it in the unlawful way\" Then the one who is doing it in the lawful way would certainly get its reward\". (Muslim) Another hadith tells us that when a husband, upon returning home, looks at his wife love and the wife returns his glance with love Allah looks upon both of them with Mercy. Husband and wife are always together and pass a large portion of their lives in each other's company, it is but natural for frictions to arise. If these normal misunderstandings and displeasures are allowed to degenerate into bitter quarrels and cruelty to each other, then not only are worldly pleasures destroyed but the Divine reward for mutual love is also lost. Hence Allah and his blessed Messenger have formulated for us a perfect guideline for marital bliss: it can be summarized as follows: \"Do not look at only those things which displease you; think too that the partner, who is displeasing you, has some good qualities as well. If you think of these good qualities, the good relationship with your spouse shall be restored\". Allah has said:- /,, ,@ < , J , ~ [Arabic Text Image] ,,< 0~ J J * , # % J I & ~ ~ I + & O I # & ~ ~ ~ ~ * '*./,. ~PUU [Arabic Text Image] In a hadith the Messenger of Allah, may he be eternally blessed, has directed as follows: / C / 7 , , 0 9 9 , , , / , + 9 + , f i 9 7 ) t / / d & ~ ! ~ a , ~ & t - ~ ~ r o . ' ~ \"No believer should have total dislike of a believing woman (because) if he dislikes one thing, there would be some quality [in her) which he would surely 1 ike \" If husband and wife follow this principle and live with mutual love land try their best to be good to each other, their marital life shall be enriched with happiness and they shall go on earning more and more merits and Divine rewards all their lives."
    },
    {
        "id": 28,
        "title": "Maintaining Kinship Ties",
        "content": "RELATIVES Good treatment of relatives is very pleasing to Allah and earns much merit. It has also been enjoined by the Holy Qur'an in several places and its merits described, for instance (A1 Nisa': 36) Show kindness unto parents and unto near kindred (A1 Nisa': I ) Be careful of your duty to wards Allah in Whom you claim your rights and to wards the womb that bore YOU Abu Hurairah relates that our Holy Prophet - may he be eternallv blessed - said that \"He who believes in Allah and in the Day of Judgement, should treat his relations well\". (Bukhari and Muslim) And according to Anas, the Holy Prophet said that * + ; @ \"He, who desires his earnings to increase and his life to be long, should treat his relations well\", (Bukhari and Muslim) Good treatment means courteous behavior, sharing in happiness and grief and helping them in a lawful manner whenever required. However some points regarding this good treatment must always to kept in mind. (1) Some people treat their relatives so well that they do not hesitate to sin for them in wrong belief that this is what has been enjoined on them. To share in sinning with a relative, to recommend them undeserving, or to get them an employment for which they are not suited etc. are all unlawful in Islam; good treatment of relatives does not encompass committing sins for them. Hence when a relative seeks helps or support for any unlawful end, a polite excuse is called for. (2) Good treatment of relatives is meritorious and rewarding only when it is motivated by the desire to earn Divine pleasure and not by any urge to show off or to keep up with others or to follow customs. Our present day society is shackled by customs and traditions; good treatment of relatives is usually motivated by the desire to save face or out of one-up manship; hence many things not really desired or liked are done due to the force of customs. Consequently, one must not allow himself to be motivated by such thoughts and if any good is done to any relative or kinsman it must be done only to earn Allah's pleasure, and with happiness and grace; nothing should be done to complete a formality or fulfil a custom. (3) Since good treatment of kinsmen should be for the sake of Divine pleasure, one must never expect or wait for a good deed in return. Even when the return is not good, ore should not abandon good treatment of his relations. Actually this is the acid test that shows whether the good treatment is for Allah or merelv for show. Our eternally Prophet has said: \"He does not treat his relations well - who merely returns a good deed; he who treats them well even when they deny his rights really treats them well\". (Sahih Bukhari) Umme Kulthum bin Aqabah has related that the eternally blessed Messenger of Allah said: \"The best sadaqah is the one given to inimical relatives (Hakim and Tabrani: A1 Targheeb wa a1 Tarheeb, p.120. volume 4). Real and true good treatment is the one given even when one's relations treat him badly; this earns much merit. Abu Hurairah relates \"Someone said to the Messenger of Allah 'I have some relatives whom I treat well, but they deny me my rights; I treat them well, but they treat me badly. I am forbearing, but they quarrel with mef. The Messenger of Allah said 'If this is really so then you are feeding them hot ashes. Allah shall always give you a helper' (Sahih Muslim). It means that they were acquiring hell fire by their deeds, and they would never harm him; rather he would be helped against them by Allah."
    },
    {
        "id": 29,
        "title": "Good Treatment of Neighbors",
        "content": "NEIGHBOR Neighbour's rights are many and are ordained by Allah. Our holy Prophet, may he be eternally 6 : @ f 0 / 6 < / , , p , : , , , , [Arabic Text Image] '0 blessed, has said: &,p4,++,uL+,t&jb 0 - , - ' \"Gabriel advised me so much regarding neighbour's rights that I began to suspect that he would be included among the heirs\" (Bukhari and Muslim and Ibn Omar and Ayesha). Abu Sharih relates that the eternally blessed Holy Prophet said , 80'! . d 9 [Arabic Text Image] $ , 5 0 0 / , 0 U G $ ~ $ ' Y ~ & I , ?U\\w3,d\\f~ $ 0 \"He who believes in Allah and in the Day of Judgement should be good to his neighbour\" (Sahih Muslim) Abu Huraira has quoted the Messenger of Allah as follows: 6 ' / . $ D ' < ,d* ,/a, L % # f ' ,/ - b ~ b ? [Arabic Text Image] pdbyb+~c)I(ct. \"He who believes in Allah and the Day of Judgement should not cause pain to his neighbour\" (Bukhari and Muslim) The first and foremost and the principal right of the neighbor is not to cause him pain, trouble or sorrow; moreover, helping him in his need, sending him occasional gifts, sharing his joys and sorrows are all meritorious and rewarding acts. In fact if one's neighbor is poor or in financial straits he should be helped monetarily too. Neighbour is not necessarily one's equal in social or material sense; poor neighbours are also neighbours and they have all the more rights as they are in greater need of help and assistance, If a neighbour is hungry, it is not merely meritorious to feed him but also a bounden duty. Even I a unbeliever neighbour should be treated well. It has been related that Abdullah ibn Omar had a Jew as a neighbour; once when a goat was slaughtered, ibn Omar kept on insisting upon his household to present some meat to the Jew also. (Abu Daud and Tirmidhi)."
    },
    {
        "id": 30,
        "title": "Being Cheerful",
        "content": "Cordial and courteous behavior is very pleasing to Allah and is also rewarding. Abu Dhar Ghifari has related that our eternally blessed Prophet said: f ,, pa< ,,,f/ 4 / 4Q4 Jc;,&w,.';~$;~\\&g$y \"Never decry any good deed, even though it may be (as ordinary as) meeting your brother cordially. Thus cordial behavior to wards others should never be considered lowly as it too adds much good to one's record. Abu Darda quotes our Prophet - may he be blessed till eternity in the fallowing words: \",?- ' f ,,' '=f, ,. J ' : ; * 0 : C U I ~ > ~ + ~ ~ I ' $ ~ ~ ~ ; ; -4 ., I e ' k g & .' /, 0 7 [Arabic Text Image] ', '>' [Arabic Text Image] , . / \"On the day of judgment nothing in the scales (of Divine justice) shall be weightier than a mum in's cordiality and courtesy: Allah very much dislikes one who speaks obscenely\" (lami Tirmidhi) Abu Hurairah says that once our Prophet upon him be eternal peace - was asked \"what would admit most men to the Paradise'!\" He said \"Piety and cordiality\" In another tradition, Abu Hurairah has quoted the follbwing words of our blessed Holv Prophet: * B r J J , ~ , ' a ,s * 0 > ~ / # 5 ~ i ~ l b 4 \\ ~ $ 1 3 c f 3 1 \"Off all the men of faith, those are best who have best manners towards others\". (Tirmidhi) Ayesha (may Allah be pleased with her) has quoted the following words of our respected and J,J f-,0, J 0 ' f % J & blessed Prophet. # F' I A+ J [Arabic Text Image] &J e+l c;rb 'X man of faith attains by virtue of his good moral behavior and courtesy and cordiality the status of one who is a keeper of fasts and stands in prayer\" (i.e. who fasts as nafl and prays as nail. (Tirmidhi) Jabir relates that our Prophet - upon whom be eternal peace said \"Those who are dearest to me and who shall be closest to me in the gathering on the Day of Judgement are those who shall be better than others in their moral behavior\" The cordial and courteous behavior mentioned in these Prophetic sayings have a wide range of connotations, but cordiality to others and courtesy are important constiments of moral behaviour and these merits mentioned above are true of them too."
    },
    {
        "id": 31,
        "title": "Good Travel Companionship",
        "content": "CO-TRAVELLERS Just as Allah has ordained many neighborly rights, similarly has he defined many rights of co.- travellers. Co-traveller is the one whom one may not know before hand but in whole company one travels; e.g. the one sitting near in buses, trains, ship and aeroplanes. Such a person has been termed in the Qur'an, i.e. one who is a temporary neighbor. This co- traveller should not be put into any trouble by one's actions; this is his right. Some do not hesitate to put other to much trouble for their own comfort; they should ponder the fact that every journey ends somehow sooner or later, but even in this short period, if one's action cause trouble to the co-travellers a great sin shall be recorded in his name. And since this sin involves human rights it would not pardoned by merely seeking of Divine pardon unless the aggrieved person pardons it. Usually one does not meet one's co- travellers again, nor arc their addresses known so that one may ask them for forgiveness. Once the journey is over, it is almost impossible to beg their forgiveness. Hence one should take great care nor to cause any trouble, pain or injury to one's co- travellers. On the other hand, co-travellers are to be treated with great kindness, consideration, courtesy and cordiality and one should try to give them every possible comfort or at least be cordial to them. This is an act of great merit which can be earned by very simple means provided one is prepared for it."
    },
    {
        "id": 32,
        "title": "Meeting for Allah's Sake",
        "content": "MEETING FOR ALLAH Meeting a Muslim for Allah only is an act of great merit. Meeting for Allah means meeting not for the sake of any mundane gain, but for Allah's pleasure only; for instance one may go to meet a learned man or a sage in order to learn something for self- improvement or one may meet someone to please him believing that giving pleasure to a Muslim pleases Allah. Both these cases are meetings for Allah and, Allah willing, shall earn much merit. Abu Hurairah has quoted the following words of or Prophet - upon whom be eternal peace: \"One, who visits a sick person or goes to meet his brother for Allah, is called by a (hidden) caller who says to him 'Blessed art Chow, blessed is thine going, thou past made thyself a home in one stage of the Paradise\". (Tirmidhi' Wa-qal: Hasan) This hadith shows that meeting a Muslim for the sake of merit also increase one's good deeds in the Record. But it should be noted that this order relates only to meeting those whose company does not cause any religious loss; but if it is feared that the meeting would cause one to be involved in a sin or to be adversely affected, or one would be compelled to listen to tirades against third persons or lose much time in senseless talk, then such meeting must be avoided."
    },
    {
        "id": 33,
        "title": "Honoring Guests",
        "content": "Showing respect and appropriate hospitality to guests is an important part of our religious behavior and has been much emphasized. Our Blessed Prophet said, according to Abu Hurairah, that [Arabic Text Image] 9 \" 4' P 9 9 , ',/ [Arabic Text Image] ' / 18g64~4~u16i / \"He who believes in Allah and the Day of Judgement should treat his guest with respect and courtesy\" (Bukhari and Muslim) This injunction tells us to greet our guest cordially, to offer him food if it is time for eating. In fact one hadith tells us to prepare special food for the guest on the first day provided one can afford it. This has been called jaiza in kladith (Sahih Bukhari: from Abi Shuraih) However, unnecessary and senseless show and pomp and observance of formalities and customs should be avoided. First of all, one should care for the guest's comfort: hence one should not insist upon feeding him if that would cause him pain or trouble. In such a case his comfort and will should be respected. Guests too should not unnecessarily burden the host and should not overstay; it has been expressly forbidden by a hadith in Sahih Muslim. I"
    },
    {
        "id": 34,
        "title": "Removing Obstacles",
        "content": "THINGS FROM THE WAY Removing dirt and filth and other troublesome things like thorns or fruit peels or skins on which someone may slip from the way is a very good deed. Our Prophet upon whom be eternal blessings has been quoted by Abu Hurairah as follows: \"Belief has more than seventy divisions of which the highest is the assertion I I that there is no god but Allah and the lowest is to remove something that causes pain or trouble and filth from I I I the way\" In another hadith related by Abu Hurairah, the Messenger of Allah said \"Removing filth (or pa in - giving thing) from the way is a sadaqah (i. e. it earn mere like sadaqah)\". i (Bukhari and Muslim) Ayesha (may Allah be pleased with her) quoted the Holy Prophet - may he be ever in peace - as 0 / ' / ,D / r / * / / / ' / / / & / < t 5 , 1 [Arabic Text Image] UI-b / , ',/ e [Arabic Text Image] 9 1 , / [Arabic Text Image] ,I,/ \" ' J&Uu,lsjJzUirb qal*pdw\" * [Arabic Text Image] D29'6\" ' , ~ & ~ l ; ~ l ~ $ 'd js-r.w-+j, , \"0 ,' [Arabic Text Image] ',Q,&& [Arabic Text Image] h \"Everyone of the human race as three hundred and sxty joints. So anyone who speaks greatness of Allah, praises Allah and says 'There is no god but Allah' and \"Subhan Allah\" and seeks forgiveness of Allah and removes a stone or thorn or a bone from the path of people, orders a good deed or forbids (others) from a bad one and reaches the three hundred and sixty mark, he shall verily remove himself way or place as to block others' path or to make it difficult for them and it is a sin. Similarly driving in a way which is in any way troublesome for others is also a sin. Traffic rules have been formulated and promulgated to organize traffic on the roads; their observance is not merely Iegally compulsory but also a religious duty. If one observes these rules and laws in order to promote discipline in the sbciety and public welfare, then these acts shall be rewarded. And if these rules are not observed then the sin shall be twice as great: for causing trouble to the people and again for disrupting discipline and breaking laws. - away from the chastisement of hell\". It is indeed a matter of regret that today such According to another hadith, our Holy Prophet bad acts are no longer considered sinful and even said that once a man saw a thorny branch on his path educated persons commit these sins thoughtlessly. and removed it in order to save others from pain (due May Allah grant us the right understanding of our to being pricked by it) and Allah was pleased by his religion and the opportunity to act according to it. this deed and pardoned him. In another hadith, it is related that our Holy Prophet said, that he saw the man walking about in the Paradise. These ahadith show how important it is in Islam to keep the roads and paths clear. Even removal of a thorny branch, which is a very minor act, has been I promised so much reward and merit. When so much emphasis has been laid on removing things of pain from the path, it can be imagined how great a sin it would be to make a path dirty and give trouble to passers by. Causing trouble to passers by also includes parking one's vehicle (car, motor cycle etc.) in such a"
    },
    {
        "id": 35,
        "title": "Refraining from Arguments",
        "content": "AVOIDANCE OF QUARREL Quarrel is very much disliked by Allah and a quarrelsome person has been decried in Qur'an; in contrast, forbearance, equanimity and avoidance of quarrel arc attributes pleasing to Allah anti he who has them is rewarded for them. Abdullah ibn Abbas has related that addressing a man of Abd-al-Qais ,,/ [Arabic Text Image] .: tribe, our blessed Holy Prophet said: &&dl, -, J 1 + # , > 9 7 5 > L ,I<, SI;~I,&I 8 CuJlL4.m - 8 - \"You have two traits that Allah likes forbearance and dignity\" (Sah ih Muslim) So if someone be in the right and yet does he relinquish his right solely in order to avoid strife and quarrel or make peace, such a man has been given glad tidings by our Prophet may he be eternally blessed, who has been quoted as follows by A ~ U urnamah: , , , , . ,- J 0 O D c .I / I, [Arabic Text Image] + \\ ~ Y J + [Arabic Text Image] d j , / t 4* ,/' b c 1 6 \" guarantee a home on the v6rges of Paradise him who gives up quarrel even though he may be in the right\" (Sunan Abu Da'ud) How fortunate a man who has been given glad tiding and even guaranteed a home in the Paradise! May Allah grant such an opportunity to all Muslims, amin!"
    },
    {
        "id": 36,
        "title": "Learning Religion",
        "content": "OF FAITH It is the duty of every Muslim to know as much about his Faith as to enable him to lead his life according to it, it is not necessary for everyone to become a theologian, only necessary learning is necessary; e.g. important points about prayers, hajj and zakat (poor-due) and what is allowed and what is forbidden in matters of everyday life While acquisition of knowledge is a duty, observance of religious duties in the light of this knowledge has obviously been promised much reward and merit. Every act of learning Faith is a good deed in itself and hay been much lauded in Qur'an anti also hadith. For instance, according to Abu Darda', our eternally blessed Prophet said that: \"For the one who walks a path in order to acquire some knowledge. Allah makes the path to Paradise easy; and angels being pleased with this deed of the seeker after knowledge, spread their wings in his path\". (Abu Daud; Tirmidhi) This encompasses not only those seekers of knowledge who study religion in a regular way but also those who seek answers to their problems by going to a learned person or by sitting in a sermon. Anas has quoted the following words of the Holy Prophet: ,= , , ,.' .-9l4@i+'1&ji:- R 4 , ,, e2 ''He who goes out of his home to seek I knowledge is in the way of Allah till he returns. (Jam i-Tirm idh i) I Thus whatever step one takes to learn any aspect of the faith of Islam would, Allah willing, earn hlm I the merit and reward due to a seeker of knowledge: even study of religious books, provided they arc genuine, earns for one the same merit and reward. I Hence one should choose one's books in consultation with a learned man. One should never pass up an opportunity to learn anything of the faith. It will increase knowledge, improve one's life and increases the good in one's record. Knowledge is an unbounded , ocean and the more one learns the more becomes his thirst for knowledge, and it should be so. Hadith tells us that one who is greedy for knowledge is never satiated. He is ever seeking more knowledge and thus the acquisition of merit goes on and on. I"
    },
    {
        "id": 37,
        "title": "Teaching Religion",
        "content": "Teaching religion is for more meritorious an act than learning religion, provided one does not expound religious to show off his own erudition but teaches to benefit others. Abu Umamah has quoted the following words of our Prophet - may he be eternally blessed: Allah the Most High and His angels and all creatures of the Heavens and earth even the ants inside their ant-holes shower mercy on those who teach things of benefit to other. (Jame Tirmidhi) whom be peace, addressed Ali as follows: 'u J a s 6 ~ # + 8 4 2 8 H #A 0 8<,sd f i l ~ & l ~ 1 L + . ~ ~ U~WUY @ \"If Allah gives guidance to even one person through you it is far better for you than red camels (Bukhari and Muslim). Red camels were highly prized among the Arabs. Thus this hadith means that if your teaching benefit someone it is better than all wealth in the world. Hence whenever one gets a chance to teach others, particularly one's own wife and children, any aspect of religion, one should avail it and continue doing this good deed because it is a perpetual source of merit."
    },
    {
        "id": 38,
        "title": "Respecting Elders",
        "content": "Although piety and knowledge are the true attributes of greatness in Islam, the youngsters have been enjoined to give due respect to their elder. Our Prophet - upon whom be peace - went to the extent * ?80<8, 0 8 / , ( # , # , of saying that d g j + dfij L+-.~, # r ''He is not of us who does not have kindness for our young and respect for our old\" (Abu Daud and Tirmidhi) Grey-haired folk have been specially indicated as objects if our respect in hadith. Abu Musa Ashari relates that our Prophet - may he be eternally blessed / - said: &I , + + ! & ~ ~ ~ ~ ' U , ~ O I $ + ! ~ W ~ ./.- // o O r r l c Sahl bin Sa'd relates that once our Prophet upon \"Respect for a grey-haired Muslim is a part of respect for Allah'' [Abu Daud) Another Prophetic saying has been related by \"For youth who respects an old man because of his age. Allah appoints people who shall respect the young man in his old age. It was a custom of our eternally blessed Prophet that if a younger member of a delegation began to speak, the holy Prophet asked him to let the elders speak first. This shows the great emphasis, laid by our blessed Prophet upon respect for elders which is highly merited and rewarded."
    },
    {
        "id": 39,
        "title": "Respecting Signs of Islam",
        "content": "WAYS AND CUSTOMS All those things which symbolize Islam and Muslim, e.g. Qur'an, Kaaba, Mosque, holy places, prayers, adhem, etc. should be respected, this too is an act of high merit, as the Qur'an s a y s : $ ~ ~ ~ $ A d * / J C , / y < L8 * - [Arabic Text Image]"
    },
    {
        "id": 40,
        "title": "Kindness to Children",
        "content": "Kindness to children is a Prophetic sunnah, as mentioned earlier: our Prophet said that he was not one of us who did not have kindness for the younger ones. Hadith quotes our eternally Prophet's words as follows: when I hear a child crying while I am leading the prayer I shorten them so that the child's mother may not be agitated by the child's crying. Our Prophet took children in his arms, kissed them and talked to them in a light vein. All these acts are sunnah and to do them with the intent of following the sunnah is meritorious and recoending."
    },
    {
        "id": 41,
        "title": "Performing Adhan",
        "content": "Calling to prayer, i.e. adhan is a custom of Islam and Prophetic sayings attribute many merits to the act. According to a hadith quoted by both Bukhari and Muslim, our Holy Prophet -- upon whom be peace - has said that if people knew the real reward and merit of calling to prayer, everyone would try to give the call and lots would have to be drawn. Nowadays muezzins are appointed in mosques to give the call to prayer, but if one prays at a place other than mosque where the sound of the call has not reached, he should observe sunnah by giving the call and earn the merit thereof. Abu Saeed Khudri once said to Abdullah the son of Abdur Rahman ibn Sa'sa'a \"I see that you are very fond of goats and the desert. Henceforth whenever you are among your goats or in the desert and give the call to prayer. call loudly because whosoever shall hear the call. jinns or men or other things, would bear evidence for the giver of the call on the day of Judgement. Having said this, Abu Saeed Khidri added that the had heard it from the Messenger of Allah, upon whom be eternal blessings. This shows the merits of giving the call the prayer."
    },
    {
        "id": 42,
        "title": "Responding to Adhan",
        "content": "RESPONDING TO ADHAN To show respect for adhan, one should keep as quiet as possible while the call is being given; and it has been emphasized by our Holy and blessed Prophet that each word of adhan should be responded to, i.e. the hearer should repeat each word that the giver of the call utters. However. when [Arabic Text Image] and are said, the responder should say ~ ' ) @ I & ~ ~ ~%33;3;;.g And in the fajr prayer when the giver of the call says one should respond with 9% A52 Abdullah ibn Omar has relates that our blessed Prophet said as follow: \"When you hear azan, repeat the words after the muazzin then send darud unto me because on him who sends one darud unto me Allah sends ten mercies. Then pray for \"Vaseela\" for me because that is a stage of the Paradise which is reserved for only one of Allah's bond men and I hope it will be me who shall get it. Thus he who prays for Vaseela for me shall have right to my interceasing for Divine pardon.\" (Sahih Muslim) It is because of this that our blessed Prophet has taught us a prayer which includes prayer for I - 0 s : ' 0 G 1 Vaseela: 8 ' L % I ~ ~ I , , L ~ ~ ' * & ~ ~ ~ + C [Arabic Text Image] ' 0 0 B <0 0 , * , / , . I > ; t ~ & + d i w ~ ~ ~ ~ ~ -/ - 8 J J* [Arabic Text Image] Jabir relates that our blessed Prophet has said that whosoever recited this prayer after adhan would be assured of our Prophet's intercession on the day of Judqement (BuMari) Moreover, reciting the following words after / adhan is also recommended bv hadifh & y . '# ' # , J & :,,-12, 2' J #.' ;3F, W J ~ J ,u ~ ) Saad ibn Waqqas has quofed our bleded Prophet as saying that he who utters the above words after adhan is pardoned (Sahih Muslim). Responding to adhan and then reciting the above prayers does not take much time; one has only to remember and get into the habit to earn much merit and reward. Unless there is a genuine reason, one must observe these instructions. In this connection it should be noted that if one hears adhans from several mosques one after the other, he should recite the recommended prayers after the first adhan only; this completes the observance of sunnah."
    },
    {
        "id": 43,
        "title": "Reciting Quran",
        "content": "READING THE QURAN Qur'an is Allah's greatest gift to the entire mankind. It must be read, understood and acted upon, but mere reading and reciting of Qur'an have also been designated by Allah as acts of merit that deserve rewards. Mere recital of the words of the Qur'an is enough to invoke Allah's mercy, but many think, foolishly or unknowingly that reading of Qur'an without understanding what it says is of no use. They think the Divine book is like a other books written by men which have to be understood. But Qur'an, a Divine Book, is different; it guarantees well-being and success in this life as well as the afterlife and mere reading or reciting it is in itself rewarding and meritorious. Abdullah ibn Uas'ud relates that our blessed Prophet has said ''He who reads one word of Allah's book gets one merit which is in fact equal to ten merits. I do not say that is one word, is one word, is one word and is one word\". (Tirm idh i) This shows that if anyone recites only, it is enough for thirty merits to be recorded. It also proves that mere reading or recital without understanding is also rewarding since is a word the meanings of which are unknown and so it is impossible to understand it. Thus our blessed Prophet, by giving this examples proved that reward for reading or reciting Qur'an does not depend upon understanding it, but mere reading or recital is rewarding in itself. Hence every Muslim, before busying himself with other work, must read sonic portion - one para or half or one quarter or even one ruku'of the Qur'an without fail; this shall assuredly earn him ever increasing merit every day. Moreover, every Muslim must commit to memory some surahs for ready recital without having to open the book. According to Ibn Abbas, our blessed Prophet has said ''He whose mind does not have some portion of Qur'an is like an empty house\"."
    },
    {
        "id": 44,
        "title": "Reciting Surah Fatihah & Ikhlas",
        "content": "SURAH FATEHA AND SURA IKHLAS Although reading or reciting any part of Qur'an is an act of merit, but reading or reciting of certain surahs have been indicated by our blessed Prophet as particularly meritorious and rewarding. Among the short surahs. Surah ikhlas has been indicated as much rewarding; indeed, it has been said in some hadiths to be equivalent to one-third Qur'an. Abu Hurairah has related that once our revered and blessed Prophet said to the companions \"Come together, 1 shall recite one-third Qur'an before you\". Some companions collected and the Holy Prophet came out of his house and recited and went back. Shortly he came out and said. \"1 had said that I shall recite one-third Qur'an before you. Remember, this is equal to one-third Qur'an\" (Muslim and Tirmidhi). Abu Darda' has related that once, addressing the companions, our eternally blessed Prophet asked \"Can anyone of you not recite one-third Qur'an in one night?\" She Companions sail \"How can anyone recite one-third Qur'an in one night?\" The Holy Prophet said 9 2 J- \"Recite v u ~ . ; t r + ~ it is equal to one-third Qur'an\" (Sahih Muslim). This why Surah ikhlas is recited three times to bless the dead."
    },
    {
        "id": 45,
        "title": "Perfecting Wudu",
        "content": "CAREFUL ABLUTION (WADHU ) Ablution or wadhu wit11 full observance of its rules according to sunnah is a sublime act for which hadith has promised many merits and rewards. Uthman ibn Affan relates that our eternally blessed Prophet has said: / *( J < > J J < < < , - b ~ l ; b ; t ? ~ ~ ~ I / \"One who performs ablution and does well expunges sins from his body even under his nails\" Another hadith relates that once our Prophet, upon whom be showered Divine Blessings eternally, said to the Companions, \"Do I tell you the things due to which Allah the Most High eradicates (your) sins and elevates (you)?\" The Companion said ' 0 Messenger of Allah'. Do tell us\". The Holy Prophet, be he blessed, said To perform complete ablution in spite of not wanting it, to take many steps to the mosque, and to wait for next prayers after one prayer. this act is as sublime as jihad.\" (Muslim and Tirm idh i) This means that even when one does not feel like performing ablution due to, say, cold weather etc. its performing is as meritorious and rewarding as guarding the frontier in jihad. Correct ablution means ablution as prescribed in the sunnah. Hence one must follow and observe the prescribed method of ablution and if one does not know it, he must learn it."
    },
    {
        "id": 46,
        "title": "Using Miswak",
        "content": "MISVAK The eternally blessed Messenger of Allah has highly contended the use of miswak (to clean the teeth). Ayesha - may Allah be pleased with her - has related that the blessed Messenger of Allah has said: \"Miswak is a means of cleaning the mouth and of earning Divine Pleasure\" (Sunan Nasai) 0 s h 0 9H B < < \" .I;T)L j)~;3\\3.~, d * / I , , , & Praying (with the) use of miswak is seventy times superior to praying without miswak (AI-Torghib p.131 v. I with ref. Hakim Alam) Use of miswak has been lauded in countless ahadith and it is among the favorite sunnahs of the blessed Messenger of Allah. It has advantage in this life and in the after-life too! It is a simple and easy task which can acid to our merits."
    },
    {
        "id": 47,
        "title": "Dhikr after Wudu",
        "content": "(WADHU) Omar relates that our Prophet - upon whom be eternal peace - said that for one who, after careful and correct ablution, recites: - [Arabic Text Image] [Arabic Text Image] ' 0 3 ~ ~ 3 [Arabic Text Image] all eight doors of the Heaven are opened so that he may enter by whichever door he wants. (Sahih Muslim) The tradition according to Abu Daud also adds that one should look up towards the sky when saying these words and according to Tirmidhi one should also add , .='/a #g ,L / L,b, * *;q.I\\r(i2\\ [Arabic Text Image] \\ / ', ; [Arabic Text Image] to the above words. [Arabic Text Image] I"
    },
    {
        "id": 48,
        "title": "Tahiyyat al-Wudu",
        "content": "Wadhu or ablution may be performed for any purpose. and praying two rak'ats after every wadhu as tahiyyat-a1 wazu is a highly meritorious act. Ayaba ibn Amir has related that the blessed Prophet said \"When one performs ablution and performs it well and then prays two rak'ats in such a way that his face and also his heart are turned to Allah. Paradise becomes a certainly for him\" (Muslim. A bu Da 'ud. Nasa i) Abu Hurairah has related that the eternally blessed Messenger of Allah said to Bilal, 'Tell me from which of your acts you expect most merit. because during Meraj (Assertion) 1 heard your footsteps in front of me\". Bilal submitted 'The act due to which I expect maximum mercy from Allah is that whenever during day or night. 1 have performed ablution. I have prayed I as much as I could\". (Bukhari and Muslim) It takes two or three minutes in praying two rak'ats after Wadhu, but it is immensely rewarding. So one should do it. If it in time of (one of the five compulsory) prayers, then it is better to pray two rak'ats tahiyyat-a1 Wadhu first, but if there is no time for it then ford or sunnah should be performed with (additional) intent of tahiyyat-al-wadhu. This might care the merit due to tahi yyat-al-Wadhu."
    },
    {
        "id": 49,
        "title": "Tahiyyat al-Masjid",
        "content": ""
    },
    {
        "id": 50,
        "title": "Intention of I'tikaf",
        "content": "Whenever one enters a mosque either to pray or for any other purposes one should have the intent of obseming Itekaf as long as he would remain in the Praying two rakats with the intent of tahiyyat- mosque. This shall earn him the merit and reward of al-masjid immediately upon entering a mosque is Itekaf indicated in hadith, as our blessed Messenger of Allah said \"When anyone of you comes into a mosque, he should pray two rak'ats\" (Tirm idh i)"
    },
    {
        "id": 51,
        "title": "Praying in First Row",
        "content": "Although tahiyyat-ul -masjid should be prayed separately, but if the tune for fard or sunnah has come, then the niyyat for tahiyyat al-masjid should be added to fardh or sunnah as the case may be. If is hoped that thus one would be able to get the merit of tahiyyat al-masjid. The correct way to pray tahiyyat-al-masjid is to perform it upon entering the mosque before sitting down. But if one sit down first for some reason, then too he can pray tahiyyat-al-masjid. However, if the time is really too short to perform tahiyyat-al-masjid then one should at least recite the following: >'\"D!.J / J 8 G , 1, L J , / # ; , ,,, [Arabic Text Image] & l ~ ! d l ~ ~ c ~ & l , , k u ~ ~ ~ f r / ./ dl&, ,A,+ [Arabic Text Image] / / C / This Kalima should be recited as long as one is sitting in the mosque, as this has been equated in hadilh to partaking of the fruits of paradise. Congregational prayer is twenty seven times superior to praying alone, and in congregational prayer, praying in the first row is of such a great merit that our blessed Prophet has said \"If you know how superior is the first row lots would have to be draw^\" (Sahih Muslim). Abu Umamah has relates that the blessed Messenger of Allah has said \"Allah and His angles shower mercies on the first row\" (Musnad-e-Ahmed). 'Arabd bin Sariyah has related that our eternally blessed Prophet sought Divine pardon thrice for the first row and only once for the second row. (Nasai and Ibn Majah) Hence one should try to be in the first row in every congregational prayer, or at least whenever there is a chance. But, it is not permitted to force one's way into the first row in such a way as to cause trouble to others. Abbas has quoted the following Prophetic words: <4' 4/50 .;'#s<f f , O w $ 4 5 , [Arabic Text Image] - ' ~ ~ I ~ ~ ~ ~ ~ ~ ~ C L J ~ Y I ~ ~ ~ ~ ~ 8 - C b -' /,/r'/,t - J3Yl+Jlx14ul, # He who leaves the first row for liar of causing trouble to others is given trice the merit of the first row by Allah (a1 Targhib, p.285. vol. I. ref. Tabrani wa fi asnadihi dhu'f)."
    },
    {
        "id": 52,
        "title": "Filling Gaps in Rows",
        "content": "PRAYER ROW. Keeping the rows in congregational prayer straight and filling of gaps therein have been highly emphasized and described acts of great merit. Abdullah ibn Omar has related that our blessed Prophet has said: > ' 1 , [Arabic Text Image] f ,,, / [Arabic Text Image] He who joins a row (i.e. fill tis gap) is rewarded by Allah with His closeness (Nasa i) Abu Jahifah relates that our eternally blessed Prophet said that he who fills the gap in a prayer row is pardoned by Allah (Targhib ref. Bazzar). In general it is more meritorious to stand on the right of the imam but if there arc more people on the right than on the left, standing on the left is according to ahadith twice as meritorious. (See A1 Targhib li a1 Mundhiri, p. 2217, vol.1 cit. ibn Hazim)."
    },
    {
        "id": 53,
        "title": "Ishraq Prayer",
        "content": "ISHRAQ PRAYER Isharay is a nafl prayer which is performed a bit after the sunrise when the sun is somewhat high, that is, usually twelve minutes after sunrise. It has only two rak'ats but ahadith arc replete with the high merits of this prayer. Abu Hurairah relates that l our Prophet - upon whom be eternal Peace - has I said that \"He who says Ishraq prayers without fail I shall have his lesser sins forgiven even though they may be as numerous as foam specks on the surface I of the sea\" (Tirmidhi and Ibn Majah) I Abu Hurairah has also related that the eternally blessed Prophet once sent some companions on jihad. They returned soon and with much booty. Someone expressed his surprise and said that he had never seen a military expedition return so soon and with so much booty. The Holy Prophet said \"Should I not tell you about the men who would come back even sooner and with still more booty'?,\" then he said \"He who performs his ablution moll, then completes his fajr prayer and then (after sunrise) performs his ishraq prayer, come, sooner and with greater booty\" m g h i b p.427. vol I ref. Abu Yate ba Isnad-e-Sahib). We have already cited the tradition related by Abu Dhar Ghifari that tells us that man has three hundred and sixty joints in his body and to rid each of them from hell-fire, he should do at least three hundred and sixty good deeds, which were subsequently described by our Holy Prophet. He said that saying Subhan Allah once in one good deed, saying a1 Hamdu Lillah is another and saying La naha fllallah is the third: to bid someone do good is a good deed and to stop someone from sin is also a good deed. Then after reciting the whole list, our Prophet said: 'IAnd in place of all these good deeds, two rakats prayed at the time of ishraq can also suffice (Sahrh Muslim) This clearly means that these two rak'ats are equivalent to three hundred and sixty good deeds. The best way of performing Ishraqprayers is to sit in place after fajr prayers and do dhikr and then leave after saying ishraq prayers when the sum has risen. gut if one cannot follow this, then he can say ishraq prayers after coming back home or after doing something he has to do."
    },
    {
        "id": 54,
        "title": "Friday Preparations",
        "content": "BATHING AND USE OF PERFUME ON FRIDAY Bathing on Friday has been highly commended in ahadith. One should have the intent of bathing on Friday while taking his bath. Wearing a perfume is a sunnah and following it is mentorious and rewarding. Abu Ayyub Ansari has related that our blessed Prophet has said that: \"If one bathes on Friday and puts on perfume if he has it and wears good clothes, then goes out of the house and into the mosque, then says as many rakats as he can, but causes no trouble to anyone and keeps silence till the prayer is over, this act of his atones for all lesser sins from this Friday to the next\" (Targhib ref. Musnad-e-Ahmad) Abu Umarnah has related that our Prophet - upon whom be eternal peace - said \"Bathing on Friday pulls out sin from the roots of hair\". ( Tibrani) After bathing on Friday and putting on perfume, one should hurry as soon as possible to the mosque. A hadith says that on Fridays angels stand on the portals of mosque and record the names of those who conic early. The first arrivals earn merit equivalent to the sacrifice of a camel, the next equivalent to the sacrifice of a cow, the third equivalent to that of a raim; those who come fourth earn merit equivalent to the sadaqah of a fowl and the last ones earn merit equivalent to the sadaqah of an egg. But when the imam comes for the khutba, the angels close their register (Bukhari and Muslim)"
    },
    {
        "id": 55,
        "title": "Suhoor Meal",
        "content": "Fasting, whether in Ramadhan or as nafl is a great act of worship and eating sehri is an act of merit. Anas says that our eternally blessed Prophet said \"Have sehri because it brings abundance\" (Bukh ar i) Abdullah bin Umar has related that our revered and blessed Prophet said: 1 # / < J J , [Arabic Text Image] , , ' , d b [Arabic Text Image] ~ J I & w ~ , ~ ~ , ~ u I ~ ~ \"Verily Allah and His angels shower mercy on those who have sehri\" (Targhib ref. Ibn Hibbn and Tabruni ) Abu Sa'eed Khudri relates that our blessed Prophet has said: 9 ) 0 / , / , , $ ~ # // [Arabic Text Image] R ' J ~ b i ' ~ , > / JL-I [Arabic Text Image] b ~ , G \\ A ~ L $ $ ~ , ~ I n J * / J l i2# d,+ 4~;${yh,5b ', g euii - / S F 9 * [Arabic Text Image] ' [Arabic Text Image] - 4 \"Sehri is (a source of) abundance, so do not leave it even if you take first one mouthful of watei; because Allah and His angels shower mercy on sehri- eaters\" (ib id ref. Musuad-e-Ahmad and lsnadahu Qavi). It is better to have sehri in the last part of the night."
    },
    {
        "id": 56,
        "title": "Hurrying Iftar",
        "content": "While fasting, one should hurry with iftar after one is sure that the sun has set. Delaying Iftar without any legitimate cause isn't allowed. Sahl ibn Saad has related that our blessed Prophet has said 'People shall be in welfare as long as they hurry in iftar (breaking fast) (Bukhari and Muslim) Abu Hurairah has said that our blessed Prophet has said that \"Those of His bondsmen are dear to Allah who hurry with iftar (breaking fast)\". (Musnade-Ahmad and Tirmidhi) ."
    },
    {
        "id": 57,
        "title": "Feeding a Fasting Person",
        "content": "FASTING MAN Giving Iftar to a fasting man is an act of great merit. Zaib ibn Khalik Jehmi has related that our Prophet - upon whom be peace - has said:- \"He who gives Star io another fasting person shall earn reward equivalent to a fasting man without detracting from the reward of the latter\". (Nasa i and Tirm idh i) Salman Farsi has related 'that our eternally blessed Prophet has said that, 'if one breaks the fast of another, this act shall be a source of pardon of his sins and release of his neck from hell-fire, and- he shall earn the merit of the fast of the fasting man, but the reward of the fasting man shall not be reduced\". The companion, upon hearing this submitted: \"Some of us do not have enough to break the fast of another\". Thereupon our Prophet said \"Allah shall give this reward even to those who give a date or water or a mouthful of milk to a fasting man\". (Sahih ibn Khuzaimah)"
    },
    {
        "id": 58,
        "title": "Helping Families of Mujahids/Hajis",
        "content": "HOUSEHOLD OF A HAJI OR MUJAHID Haj and jihad both are very sublime acts of worship, but for those who are unable to perform them, Allah has created means whereby they can participate in the merits of these acts. Anyone who helps a man prepare for jihad or for haj, earns, by the grace of Allah, a part of the merit of these acts of worship. Similarly looking after the household of a haji or a mujahid and to fulfil their needs also makes a person participant in haj or jihad as the case may be. Zaid bin Khali,d has related our eternally blessed Prophet hassaid:\"r/ *,,\":a \"ko\"\"#< * / ' G ' r $ ? / G / Y / J~JKOL;, L > l ' ~ i 3 , ~ > 1 ~ ~ ~ i e ~ . > 1 t ~ j b ~ ~ H [Arabic Text Image] ,' r I 6u&Jgj \" /, l & & ? k *\\ * \"He who readies a mujahid (for jihad) or a haji (for haj) (i.e. helps in providing the means) or looks after his household in his absence or gives iftar to a fasting man, earns merit equivalent to that earned by the man he has helped without the merit of the latter being lessened\". (Sunan Nasai)"
    },
    {
        "id": 59,
        "title": "Praying for Martyrdom",
        "content": "Martyrdom in the way of Allah is a sublime act, and just as martyrdom has immense rewards and merits, praying for it too earns the same merit and reward. Sahl bin Hanif has related that our blessed Prophet has said: ' N 6 L 4 ',G, '. , 9 3 ~ w,'L.Ly-:;&,$,;1'~& i. /' ' I ; , [Arabic Text Image] 1' He who prays to Allah for martyrdom with a true heart, is granted the rank of a martyr even though he dies on his bed (Sah ih Muslim) Anas has related that our blessed Prophet has ' 1 / , / 1, ,Jt [Arabic Text Image] said: +->,5,*t [Arabic Text Image] / He who sincerely craves martyrdom is granted martyrdom even though he may not apparently attain it. (Sah ih Muslim)."
    },
    {
        "id": 60,
        "title": "Early Morning Work",
        "content": "THE MORNING Staring work early in the morning has been highly lauded in the hadith corpus. Our eternally blessed Prophet has said: u,G [Arabic Text Image] \"0 Allah! Grant abundance to my ummah in its works of early morn ing\". The blessed Prophet has also prohibited sleeping just after fajr prayers prior to sunrise and has called it a source of poverty. ( Ibn Maja). Once, upon seeing Fatimah - may Allah be pleased with her - sleeping just after fajr, he woke her up and told her never to sleep at that time (Targhib, p.191, vol. i, ref. Baihaqi)"
    },
    {
        "id": 61,
        "title": "Dhikr in Marketplace",
        "content": "BUSINESS Dhikr of Allah at intervals while engaged in business is a source of great reward and merit. It is mentioned in hadith that in a place where people are oblivious of dhikr, remembrance of Allah is like being steadfast in jihad when others are running away. (Targhib, p.193, vol. 3, ref. Bazzar & Tabrani). Abu Qalaba, one of the famous followers (tabi'in) say that once two men met in the market and one said 'Come let us seek Allah's pardon when others are forgetful of Allah\". The second man did it. Then one of them died and the other saw him in a dream saying, \"Allah had pardoned us on the very same evening we lead met in the market\". Certain adhkar have been specially recommended in hadith. Omar (may Allah be pleased with him) has quoted the following words of our blessed Prophet: Our Prophet - upon whom be peace - has said that whosoever recites these words upon entering the market is granted a thousand merits by Allah and Allah pardons his thousand (minor) sins and elevates him by a thousand stages (Tirmidhi) These words should be committed memory and recited off and on during work."
    },
    {
        "id": 62,
        "title": "Accepting Returned Goods",
        "content": "TAKING BACK SOLD GOODS Sometimes a buyer wishes to return a thing he has bought. In such a case the seller is not bound to take it back, but if he does it in view of the buyer's need or his embarrassment, it would be an act of very high merit. Abu Hurairah has quoted the following Prophetic words: He who takes back'a thing sold has his sins pardoned on the Day of Judgement (Abu Daud)"
    },
    {
        "id": 63,
        "title": "Lending to Needy",
        "content": "Giving loan to a needy man is an act of great merit. Abdullah ibn Masud has quoted the Prophetic words \"Every loan is a sadaqah\", (Baihaqi and Ta bran i) Some ahadith tell us that the merit of giving loans needy man is more than that of a sadagah. (Targhib. Tabrani and Baihaqi). This is probably because a loan is usually of amount which is not intended as sadagah, and is given to needy person, who does not beg, and so its merit and reward arc correspondingly higher."
    },
    {
        "id": 64,
        "title": "Leniency with Debtors",
        "content": "POOR DEBTOR In both Qur'an and hadith, much merit has been promised to those who give time to poor debtors. The Qur'an says:- , , , ,/, [Arabic Text Image] / .. [Arabic Text Image] ' 'I s-dci'~ 6 ~ GEL! G // Abu Hurairah has quoted the following saying of the Holy Prophet - upon whom be peace: .. , '.# / S / J ~ ':#:LY /:/,; [Arabic Text Image] , [Arabic Text Image] y > 5 \\ I ~ & I w 6 % /u /,,, .st w , J , - [Arabic Text Image] * He who gives time to a poor man or reduces his debt would be placed b y Allah in the shade of His Throne on the day when there shall be no shade. (Tirmidhi, Wa-qaI. Hasan Sahih) Hadhifah has related that the Holy Prophet has said, 'The soul of a man from among the earlier ummahs was taken by, the Angel (of death). He was asked if he had ever done a good deed. He replied that he had been giving loans and had mistreated his agents to give time to poor (debtors) and to treat kindly the well-to-to. Thereupon Allah the Most High ordered the Angels, 'You too should treat him kindlyf. And thus was he pardoned."
    },
    {
        "id": 65,
        "title": "Truth in Trade",
        "content": "IN TRADE Trading is a mundane activity, but if it is done with a view to obtain lawful and' honest living and to fulfil the lawful needs of oneself and one's own family, trading because a source of reward and merit, provided one avoids unlawful activities. Honesty and truth in trading has been much lauded in hadith. Abu Said Khudri has quoted the following Prophetic tradition: A trader who is truthful and honest shall be in the company of Prophets, Siddiqun and Shuhada' (Tirm idh i )."
    },
    {
        "id": 66,
        "title": "Planting Trees",
        "content": "PLANTING TREES Planting plants and trees in appropriate places is an act of great merit. Anas has quoted the following Prophetic saying: A man plants a tree or sows a field and a man or bud eats from it, the tree or field becomes a source of sadaqah for him. [Bukhari and Muslim) In other words the merit of advantage taken by a man of beast from a plantation goes continuously to the planter as a sadaqah jariyah."
    },
    {
        "id": 67,
        "title": "Kindness to Animals",
        "content": "GOOD TREATMENT OF ANIMALS Islam has ordained rights of animals just as there arc rights of men. It is prohibited to unnecessary cause pain to harmless animals. Even the animals to be slaughtered are to be slaughtered in such a way that their suffering is maximum. Our blessed Prophet has, I ordered that knife should be properly sharpened before slaughter and every care possible should be taken of the animal to be slaughtered. (Tirmidhi). Having mercy on animals, rearing them and giving them comfort is very pleasing to Allah and is very meritorious and rewarding. Our Prophet - upon whom be peace - once related a story of man of earlier ummahs: He felt great thirst during a journey. After a great search, he found a well which lacked a bucket to draw up the water. He went down into the well and slaked his thirst and came out of the well, then he saw a thirty dog licking wet earth. The man felt great pity and felt for the dog's suffering, lie took off his leather socks and, climbing down into the well, he felt them with water and climbed out with socks held in his teeth. Allah was so pleased with this act that tic pardoned him. (Bukhari and Muslim)."
    },
    {
        "id": 68,
        "title": "Killing Harmful Animals",
        "content": "Killing harmful animals which cause pain or loss to men i in act of merit that carps reward, e.g. killing of snakes and scorpions has been promised rewards. Once Abdullah ibn Masud was preaching when he saw a snake crawling on a wall; he interrupted his sermon and killed to snake with a stick; then he said that he had heard the following saying from the Holy Prophet - may he be eternally blessed: $''&ss 6 J / ; , o ?I [Arabic Text Image] / / 5 ,, I,,:, 4u&K$.e&iGG~, One who kills a snake or scorpion acts as if he has killed a mushrik whose killing is lawful (Targhib, -p. 403 , vol. 4, ref Bazzar) The Holy Prophet has ordered of lizards. Abu Hurairah has related that the Holy Prophet - may he be blessed eternally - has said that he who kills a lizard with one blow would earn so much merit and who kills it with second blow would earn so much (here the Holy Prophet enumerated less merits than before) and who kills it with the third blow would earn so much (here the Holy Prophet enumerated even lesser than before. (Sahih Musiim) Familiarly killing of other dangerous and harmful animals cares merit."
    },
    {
        "id": 69,
        "title": "Controlling the Tongue",
        "content": "Tongue is a great gift of Allah. By it one can, if one so desires, accumulate incalculable merit for the Hereafter or one can destroy his life in the other world. This is why controlling the tongue has been much enjoined and reticence has been lauded in ahadith. Abdullah bin Masood relates that once he asked the Holy Prophet, \"Which is the best deed\"\" The Holy Prophet said Praying on time\". Then he asked 'Which act is second to it?\" The Holy Prophet said: \"That people be safe from your tongue\". (Targhib, p. .302, vol. 4. ref. Tabrani) In other words prevent your tongue from causing pain to others, from backbiting and roam cheating. I Aqabah ibn Amir asked the Holy Prophet \"What is the way to salvation?\" I He said / / D [Arabic Text Image] [Arabic Text Image] [Arabic Text Image] / /,, / ' [Arabic Text Image] -0 , ' - , \"Control your tongue and make your I house sufficient for yourself and weep ever your sins\" (Abu Daud and Tirmidhi). Making the house sufficient means that one should not unnecessarily leave his house to go out and get involved in mischief, and weeping on sins means ex pressing contrition on one's sins and seeking Divine forgiveness of them. In another hadith it is related that our blessed Prophet said to Abu Dhar Ghifari, \"Should 1 not tell you two things which sit lightly on man but are weighty in the scales (on the Day of Judgement)?. Then he said: 'Xlways be courteous and make a habit of reticence\" (Targhib, p. 312, vol. 4 ref. Tabrani, Abu Laila etc). Once our Prophet - upon whom be peace - said the same to Abu Darda' (ibid. Ref. Abu a1 Shaikh)."
    },
    {
        "id": 70,
        "title": "Avoiding Useless Activities",
        "content": "AND ACTIVITIES Everything which is of no use in this world or in the next is useless and its avoidance has been enjoined in Qur'an as well as hadith: [Arabic Text Image] ,, ?5 Y r J . r . 4 , uw+ 0 4Jlpuq+Jb / nor one who avoid shun useless conversation Abu Hurairah has related that our Holy Prophet has said: . * , / , 6) 0 h Y L. cr,SJtP~~ &* 0 -/ - A part of being a good Zuslim is avoiding useless things. (Tirmidhi ). Hence it is the duty of every Muslim to avoid useless works and activities."
    },
    {
        "id": 71,
        "title": "Six Good Deeds",
        "content": "[Arabic Text Image] SIX GOOD DEEDS Hadith tells us that our Holy Prophet - upon whom be eternal blessings has pointed out six deeds for whrch he himself has guaranteed paradise. Ibadah ibn Sanit relates the following - Prophetic saying:- \"You give me guarantee of six deeds arid I shall guarantee you Paradise. (firstly) redeem the trust placed in you; (secondly) carry out your contracts; (thirdly) speak the truth (always); (fourthly) save your (sexual) organs from (unlawful) acts; (fifthly) keep your eyes down; and (sixthly) keep your I hands (from harming others and I sinning). (Shah-al-Imam li a1 Baihaqi, p.320, 321, vo2. 4, hadith 5256)"
    },
    {
        "id": 78,
        "title": "Starting from Right",
        "content": "THE RIGHT Beginning from right is pleasing to Allah and His blessed Messenger on which one may expect merit and reward. Ayesha (may Allah be pleased with her) has said that our Prophet - be he always blessed - liked to begin from right in everything in wadhu, in combing and in putting on :hoes. ? Abu Hurairah has related the following Prophetic When you put on your dress, begin from the right (Abu Daud and Tirmidhi) and he has also related another Prophetic saylng: When inyone of you puts on his shots, begin from the right and when he takes off his shoes he should begin from the left. (Bukhari and Muslim) Similarly eating with the right hand has been commanded by our blessed Holy Prophet. Ibn Omar has related the following Prophetic saying: \"When you eat, eat with your right hand and when you drink, drink with your right hand\". (Sahih Muslim) When something is distributed, it should be from the right, as this is a Prophetic custom. One should put his left foot first when entering the lavatory and his right foot when coming out. Following this sunnah shall be source of great merit. These are minor and simple matters which should be kept in mind and followed."
    },
    {
        "id": 79,
        "title": "Cleaning Dropped Morsel",
        "content": "DROPPED MORSEL Our Prophet - may he be blessed - has also instructed us that if me accidentally drop a morsel on the ground, it should be picked up, even washed if needed, and eaten. Jabir has related the following Prophetic saying: When anyone of you drops a morsel, he should clean it of any unwanted accretion and eat if and should riot leave it for Satan. Then upon finishing, he should like his fingers as he knows not which part of the IS beneficial for him\". (Sahih Muslim). According to this hadith, disrespect for food and r drink is a Satanic act, and eating a dropped mail is a respectful act, which shall surely earn merit and reward and one must not feel ashamed of it. However, if to clean it is impossible, then it is quite another matter."
    },
    {
        "id": 80,
        "title": "Sneezing Etiquette",
        "content": "SNEEZING AND ITS RESPONSE Abu Hurairah has related a Prophetic saying: \"Allah likes sneezing and dislike yawning. When anyone of you sneezes he should say, [Arabic Text Image] and the hearer thereof should respond [Arabic Text Image] as it is a right of the one who sneezes. (Sahih Bukhari). I I There was a time when all observed these norms .f. of Islamic behavior, but now none even knows them, I hence those norms hence to revived."
    },
    {
        "id": 81,
        "title": "Fear of Allah (Taqwa)",
        "content": "Allah - by virtue of His Greatness - should be feared, as has been enjoined time and again in Qur'an as well as ahadith. Abbas the uncle of our blessed ' Holy Prophet has related that once he and others were sitting under the tree with the Holy Prophet when dry leaves began to fall from the tree till only green leaves remained. The Holy Prophet said. 'This (tree) is like a believer who trembles with fear of Allah and so sheds his sins leaving behind only good deeds\". (A1 Targhib, p. 227. vol. S. ref. Baihaqi) To create fear of Allah, we should think of His Power and Greatness, of the straits of earlier ummahs and of the chastisement mentioned in Qur'an and hadith for the disobedient ones. This shall create Allah's fear in the heart and prevent one from wrongdoing, sinning and unlawful acts, and one shall attain piety which is the basis of all good and of deliverance and salvation in this world and in the next. May Allah grant unto us the opportunity for it all Amen."
    },
    {
        "id": 82,
        "title": "Optimism & Hope",
        "content": "FROM ALLAH Beside fear of allah, expecting good from Him is an act of subline merit. Abu Hurairah has quoted a Prophetic saying: b ,,r C & ~ ~ : * + & ~ l w o ~ / 1. \"Hoping for good is also an act of worship of Allah\". (Tirmidhi and Hakim) In a hadith-e-qudsi our blessed Prophet has quoted the Divine words: J. J' [Arabic Text Image] [Arabic Text Image] , 1 /, [Arabic Text Image] *bbl,' [Arabic Text Image] bl I am lOhdt my bondsman thinks of me. And where he remembers Me, there I am with him (Bukhari and Muslim). Many merits have been given is Qnr'an and Hadith for having high hopes from Allah- This implies that one must try to live according to the Divine Commands and when he incuritably commits errors, he should expect Divine Mercy for it. But if one is entirely unmindful of Divine commands, doe's not care to reform himself, and is driven by worldly and ear desire and yet expects Divine Pardon and Mercy, he has been castigated in hadith. The right way is to try to reform oneself and to balance Allah's fear and good hopes from, Him. Anas has related that \"Once our Prophet - may he be eternally blessed - went to a young man who was on his death bed and asked him 'How do you feel?' The young man said. 'I have much bope from Allah but I also fear for my sins'. The Holy Prophet said, 'The believer who has these two ideas simultaneously at such time, Allah fulfills his hopes and grants him security from fear\". fl'irmidhi) G.T.C."
    }
]